MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_USART_MODULE             |         1         | Enable HAL USART driver module
USE_HAL_USART_REGISTER_CALLBACKS |         0         | Allow the user to define a callback
USE_HAL_USART_DMA                |         1         | Enable DMA code in USART
USE_HAL_CHECK_PARAM              |         0         | Enable runtime parameter checks
USE_HAL_USART_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE      |         0         | Enable atomicity of process state checks
USE_HAL_MUTEX                    |         0         | Enable semaphore creation for the OS
USE_HAL_USART_USER_DATA          |         0         | Add user data inside the HAL USART handle
USE_HAL_USART_GET_LAST_ERRORS    |         0         | Enable retrieval of last process error codes
USE_HAL_USART_FIFO               |         0         | Enable FIFO code in HAL USART

Software configuration defined in preprocessor environment:
Preprocessor flags               |   Default value   | Comment
-------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM             |    Not defined    | Enable parameter checks for HAL and LL
USE_ASSERT_DBG_STATE             |    Not defined    | Enable state checks for HAL

  */
/**
  * @}
  */

/* Private constants -----------------------------------------------------------*/
/** @defgroup USART_Private_Constants USART Private Constants
  * @{
  */
/*! USART transmitted dummy data                          */
#define USART_DUMMY_DATA                     (0xF)

/*! USART TX or RX enable acknowledge timeout value       */
#define USART_ENABLE_TIMEOUT_MS              100U

/*! USART BRR minimum authorized value                    */
#define USART_BRR_MIN                        0x10U

/*! USART BRR maximum authorized value                    */
#define USART_BRR_MAX                        0xFFFFU

/*! USART RX FIFO depth                                   */
#define RX_FIFO_DEPTH                        8U

/*! USART TX FIFO depth                                   */
#define TX_FIFO_DEPTH                        8U

/*! USART mask for 9-bit data length used for RDR reading */
#define USART_RDR_MASK_9_BIT                 0x01FFU

/*! USART mask for 8-bit data length used for RDR reading */
#define USART_RDR_MASK_8_BIT                 0x00FFU

/*! USART mask for 7-bit data length used for RDR reading */
#define USART_RDR_MASK_7_BIT                 0x007FU

/*! USART mask for 6-bit data length used for RDR reading */
#define USART_RDR_MASK_6_BIT                 0x003FU

/**
  * @}
  */
/* Private macros -----------------------------------------------------------*/
/** @defgroup USART_Private_Macros USART Private Macros
  * @{
  */

/** @brief  Check USART baud rate.
  * @param  baud_rate Baud rate specified by the user.
  *         The maximum baud rate is derived from the maximum clock on C5 (i.e. 144 MHz)
  *         divided by the smallest oversampling used on the USART (i.e. 8).
  * @retval 1U (baud_rate is valid) or 0U (baud_rate is invalid)
  */
#define IS_USART_BAUD_RATE(baud_rate) ((baud_rate) <= 18000000U     \
                                       && (baud_rate) > 0U)

/**
  * @brief Ensure that the number of transferred data is valid.
  * @param data_size USART TX data size.
  * @retval 1U (data_size is valid) or 0U (data_size is invalid)
  */
#define IS_USART_TX_DATA_SIZE(data_size)  ((data_size) <= 0xFFFFU)

/**
  * @brief Ensure that USART frame length is valid.
  * @param length USART frame length.
  * @retval 1U (length is valid) or 0U (length is invalid)
  */
#define IS_USART_WORD_LENGTH(length) (((length) == HAL_USART_WORD_LENGTH_7_BIT)    \
                                      || ((length) == HAL_USART_WORD_LENGTH_8_BIT) \
                                      || ((length) == HAL_USART_WORD_LENGTH_9_BIT))

/**
  * @brief Ensure that USART frame number of stop bits is valid.
  * @param stopbits USART frame number of stop bits.
  * @retval 1U (stopbits is valid) or 0U (stopbits is invalid)
  */
#define IS_USART_STOP_BITS(stopbits) (((stopbits) == HAL_USART_STOP_BIT_0_5)    \
                                      || ((stopbits) == HAL_USART_STOP_BIT_1)   \
                                      || ((stopbits) == HAL_USART_STOP_BIT_1_5) \
                                      || ((stopbits) == HAL_USART_STOP_BIT_2))
/**
  * @brief Ensure that USART frame parity is valid.
  * @param parity USART frame parity.
  * @retval 1U (parity is valid) or 0U (parity is invalid)
  */
#define IS_USART_PARITY(parity) (((parity) == HAL_USART_PARITY_NONE)     \
                                 || ((parity) == HAL_USART_PARITY_EVEN)  \
                                 || ((parity) == HAL_USART_PARITY_ODD))

/**
  * @brief Ensure that USART direction is valid.
  * @param direction USART direction.
  * @retval 1U (direction is valid) or 0U (direction is invalid)
  */
#define IS_USART_DIRECTION(direction) (((direction) == HAL_USART_DIRECTION_RX)    \
                                       || ((direction) == HAL_USART_DIRECTION_TX) \
                                       || ((direction) == HAL_USART_DIRECTION_TX_RX))

/**
  * @brief Ensure that USART Prescaler is valid.
  * @param clock_prescaler USART Prescaler value.
  * @retval 1U (clock_prescaler is valid) or 0U (clock_prescaler is invalid)
  */
#define IS_USART_PRESCALER(clock_prescaler) (((clock_prescaler) == HAL_USART_PRESCALER_DIV1)      \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV2)   \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV4)   \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV6)   \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV8)   \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV10)  \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV12)  \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV16)  \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV32)  \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV64)  \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV128) \
                                             || ((clock_prescaler) == HAL_USART_PRESCALER_DIV256))
/**
  * @brief Ensure that USART Clock Polarity is valid.
  * @param clock_polarity USART Clock Polarity value.
  * @retval 1U (clock_polarity is valid) or 0U (clock_polarity is invalid)
  */
#define IS_USART_CLOCK_POLARITY(clock_polarity) (((clock_polarity) == HAL_USART_CLOCK_POLARITY_LOW)  \
                                                 || ((clock_polarity) == HAL_USART_CLOCK_POLARITY_HIGH))
/**
  * @brief Ensure that USART Clock Phase is valid.
  * @param clock_phase USART Clock Phase value.
  * @retval 1U (clock_phase is valid) or 0U (clock_phase is invalid)
  */
#define IS_USART_CLOCK_PHASE(clock_phase) (((clock_phase) == HAL_USART_CLOCK_PHASE_1_EDGE)  \
                                           || ((clock_phase) == HAL_USART_CLOCK_PHASE_2_EDGE))
/**
  * @brief Ensure that USART Last Bit Clock Pulse is valid.
  * @param clock_last_bit USART Last Bit Clock Pulse value.
  * @retval 1U (clock_last_bit is valid) or 0U (clock_last_bit is invalid)
  */
#define IS_USART_CLOCK_LAST_BIT(clock_last_bit) (((clock_last_bit) == HAL_USART_CLOCK_LAST_BIT_DISABLED)  \
                                                 || ((clock_last_bit) == HAL_USART_CLOCK_LAST_BIT_ENABLED))

/**
  * @brief Ensure that USART mode is valid.
  * @param mode USART mode value.
  * @retval 1U (mode is valid) or 0U (mode is invalid)
  */
#define IS_USART_MODE(mode) (((mode) == HAL_USART_MODE_MASTER) \
                             || ((mode) == HAL_USART_MODE_SLAVE))

/**
  * @brief Ensure that USART Slave Select configuration is valid.
  * @param ss_config USART Slave Select configuration value.
  * @retval 1U (ss_config is valid) or 0U (ss_config is invalid)
  */
#define IS_USART_SLAVE_SELECT_CONFIG(ss_config) (((ss_config) == HAL_USART_SLAVE_SELECT_PIN_IGNORED)  \
                                                 || ((ss_config) == HAL_USART_SLAVE_SELECT_PIN_USED))

/**
  * @brief Ensure that USART request parameter is valid.
  * @param request USART request parameter.
  * @retval 1U (request is valid) or 0U (request is invalid)
  */
#define IS_USART_REQUEST_PARAMETER(request) (((request) == HAL_USART_REQUEST_RX_DATA_FLUSH)   \
                                             || ((request) == HAL_USART_REQUEST_TX_DATA_FLUSH))

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief Ensure that USART FIFO threshold level is valid.
  * @param threshold USART FIFO threshold level.
  * @retval 1U (threshold is valid) or 0U (threshold is invalid)
  */
#define IS_USART_FIFO_THRESHOLD(threshold) (((threshold) == HAL_USART_FIFO_THRESHOLD_1_8)    \
                                            || ((threshold) == HAL_USART_FIFO_THRESHOLD_1_4) \
                                            || ((threshold) == HAL_USART_FIFO_THRESHOLD_1_2) \
                                            || ((threshold) == HAL_USART_FIFO_THRESHOLD_3_4) \
                                            || ((threshold) == HAL_USART_FIFO_THRESHOLD_7_8) \
                                            || ((threshold) == HAL_USART_FIFO_THRESHOLD_8_8))

