MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
#endif /* USE_HAL_USART_FIFO */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief Ensure that USART Optional Interrupts for IT in Transmit are valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#define IS_USART_OPT_TX_IT(interrupts) (((interrupts) == HAL_USART_OPT_TX_IT_NONE)           \
                                        || ((interrupts) == HAL_USART_OPT_TX_IT_FIFO_EMPTY)  \
                                        || ((interrupts) == HAL_USART_OPT_TX_IT_DEFAULT))

/**
  * @brief Ensure that USART Optional Interrupts for IT in Receive are valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#define IS_USART_OPT_RX_IT(interrupts) (((interrupts) == HAL_USART_OPT_RX_IT_NONE)           \
                                        || ((interrupts) == HAL_USART_OPT_RX_IT_FIFO_FULL)   \
                                        || ((interrupts) == HAL_USART_OPT_RX_IT_DEFAULT))

/**
  * @brief Ensure that USART Optional Interrupts for IT in TransmitReceive are valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#define IS_USART_OPT_TXRX_IT(interrupts) (((interrupts) == HAL_USART_OPT_TXRX_IT_NONE)               \
                                          || ((interrupts) == HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY)   \
                                          || ((interrupts) == HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL)    \
                                          || ((interrupts) == HAL_USART_OPT_TXRX_IT_DEFAULT))
#endif /* USE_HAL_USART_FIFO */

#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
/**
  * @brief Ensure that USART Optional Interrupts for DMA in Transmit are valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_USART_OPT_TX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_TX_IT_NONE)         \
                                         || ((interrupts) == HAL_USART_OPT_DMA_TX_IT_HT)        \
                                         || ((interrupts) == HAL_USART_OPT_DMA_TX_IT_DEFAULT)   \
                                         || ((interrupts) == HAL_USART_OPT_DMA_TX_IT_SILENT))

#define IS_USART_DMA_TX_VALID_SILENT_MODE(handle_dma ,interrupts)                \
  (((interrupts) == HAL_USART_OPT_DMA_TX_IT_SILENT)                              \
   && (handle_dma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)

#else
#define IS_USART_OPT_TX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_TX_IT_NONE)        \
                                         || ((interrupts) == HAL_USART_OPT_DMA_TX_IT_HT)       \
                                         || ((interrupts) == HAL_USART_OPT_DMA_TX_IT_DEFAULT))
#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief Ensure that USART Optional Interrupts for DMA in Receive is valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_USART_OPT_RX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_RX_IT_NONE)         \
                                         || ((interrupts) == HAL_USART_OPT_DMA_RX_IT_HT)        \
                                         || ((interrupts) == HAL_USART_OPT_DMA_RX_IT_DEFAULT)   \
                                         || ((interrupts) == HAL_USART_OPT_DMA_RX_IT_SILENT))

#define IS_USART_DMA_RX_VALID_SILENT_MODE(handle_dma ,interrupts)                \
  (((interrupts) == HAL_USART_OPT_DMA_RX_IT_SILENT)                              \
   && (handle_dma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)

#else
#define IS_USART_OPT_RX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_RX_IT_NONE)         \
                                         || ((interrupts) == HAL_USART_OPT_DMA_RX_IT_HT)        \
                                         || ((interrupts) == HAL_USART_OPT_DMA_RX_IT_DEFAULT))

#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief Ensure that USART Optional Interrupts for DMA in TransmitReceive is valid.
  * @param interrupts USART Optional Interrupts.
  * @retval 1U (interrupt is valid) or 0U (interrupt is invalid)
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_USART_OPT_TXRX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_NONE)        \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_TX_IT_HT)    \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_RX_IT_HT)    \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_DEFAULT)  \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_SILENT))

#define IS_USART_DMA_TXRX_VALID_SILENT_MODE(handle_dmatx, handle_dmarx ,interrupts)              \
  (((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_SILENT)                                            \
   && ( (handle_dmatx->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)                       \
        || (handle_dmarx->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)) ? 0U : 1U)

#else
#define IS_USART_OPT_TXRX_DMA(interrupts) (((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_NONE)        \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_TX_IT_HT)    \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_RX_IT_HT)    \
                                           || ((interrupts) == HAL_USART_OPT_DMA_TXRX_IT_DEFAULT))
#endif /* USE_HAL_DMA_LINKEDLIST */

#endif /* USE_HAL_USART_DMA */

/**
  * @brief Check if USART instance is enabled. If yes, disable it.
  * @param handle specifies the USART Handle
  */
#define USART_ENSURE_INSTANCE_DISABLED(handle)               \
  uint32_t instance_enabled;                                 \
  do                                                         \
  {                                                          \
    instance_enabled = LL_USART_IsEnabled(handle);           \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Disable(handle);                              \
    }                                                        \
  }  while(0U)

/**
  * @brief Check if USART instance needs to be re-enabled.
  * @param handle specifies the USART Handle
  */
#define USART_ENSURE_INSTANCE_ENABLED(handle)                \
  do                                                         \
  {                                                          \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Enable(handle);                               \
    }                                                        \
  }  while(0U)

/**
  * @brief Retrieve USART instance from handle.
  * @param handle specifies the USART Handle
  */
#define USART_GET_INSTANCE(handle)   ((USART_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/** @defgroup USART_Private_Functions USART Private Functions
  * @{
  */
#if defined(USE_HAL_USART_CLK_ENABLE_MODEL) && (USE_HAL_USART_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
/** @brief  Enable the USART clock.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__STATIC_INLINE void USART_EnableClock(const hal_usart_handle_t *husart)
{
  /*! Instance USART1 */
  if (husart->instance == HAL_USART1)
  {
    HAL_RCC_USART1_EnableClock();
  }
  /*! Instance USART2 */
  if (husart->instance == HAL_USART2)
  {
    HAL_RCC_USART2_EnableClock();
  }
#if defined(USART3)
  /*! Instance USART3 */
  if (husart->instance == HAL_USART3)
  {
    HAL_RCC_USART3_EnableClock();
  }
#endif /* USART3 */
}
#endif /* USE_HAL_USART_CLK_ENABLE_MODEL */

/** @brief  Report the USART mask to apply to retrieve the received data
  *         according to the word length and to the parity bits activation.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @warning If PCE = 1 in register USART_CR1, the parity bit is not included in the data extracted
  *         by the reception API().
  *         This masking operation is not carried out in the case of
  *         DMA transfers.
  * @retval HAL_ERROR Current configuration is incorrect.
  * @retval HAL_OK RDR successfully computed.
  */
__STATIC_INLINE hal_status_t USART_RDRMaskComputation(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
  uint32_t data_width = LL_USART_GetDataWidth(p_usartx);
  uint32_t parity = LL_USART_GetParity(p_usartx);

  if (data_width == LL_USART_DATAWIDTH_9_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      husart->rdr_register_mask = USART_RDR_MASK_9_BIT;
    }
    else
    {
      husart->rdr_register_mask = USART_RDR_MASK_8_BIT;
    }
  }
  else if (data_width == LL_USART_DATAWIDTH_8_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      husart->rdr_register_mask = USART_RDR_MASK_8_BIT;
    }
    else
    {
      husart->rdr_register_mask = USART_RDR_MASK_7_BIT;
    }
  }
  else if (data_width == LL_USART_DATAWIDTH_7_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      husart->rdr_register_mask = USART_RDR_MASK_7_BIT;
    }
    else
    {
      husart->rdr_register_mask = USART_RDR_MASK_6_BIT;
    }
  }
  else
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}

static void USART_Abort(hal_usart_handle_t *husart);
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
static void USART_InitCallbacksToDefault(hal_usart_handle_t *husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
static hal_status_t USART_CheckEnabledState(hal_usart_handle_t *husart);
static hal_status_t USART_CheckCommunicationReady(hal_usart_handle_t *husart);
#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
static void USART_EndTransfer(hal_usart_handle_t *husart);
static void USART_DMATransmitCplt(hal_dma_handle_t *hdma);
static void USART_DMAReceiveCplt(hal_dma_handle_t *hdma);
static void USART_DMATxHalfCplt(hal_dma_handle_t *hdma);
static void USART_DMARxHalfCplt(hal_dma_handle_t *hdma);
static void USART_DMAError(hal_dma_handle_t *hdma);
static void USART_DMAAbortOnError(hal_dma_handle_t *hdma);
static void USART_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void USART_DMARxAbortCallback(hal_dma_handle_t *hdma);
static void USART_DMADummy(hal_dma_handle_t *hdma);

#endif /* USE_HAL_USART_DMA */
static hal_status_t USART_WaitOnFlagUntilTimeout(hal_usart_handle_t *husart, uint32_t flag, uint32_t status,
                                                 uint32_t tick_start, uint32_t timeout_ms);
static void USART_TxISR_8BIT(hal_usart_handle_t *husart);
static void USART_TxISR_16BIT(hal_usart_handle_t *husart);
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
static void USART_TxISR_8BIT_FIFOEN(hal_usart_handle_t *husart);
static void USART_TxISR_16BIT_FIFOEN(hal_usart_handle_t *husart);
#endif /* USE_HAL_USART_FIFO */
static void USART_RxISR_8BIT(hal_usart_handle_t *husart);
static void USART_RxISR_16BIT(hal_usart_handle_t *husart);
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
static void USART_RxISR_8BIT_FIFOEN(hal_usart_handle_t *husart);
static void USART_RxISR_16BIT_FIFOEN(hal_usart_handle_t *husart);
static void USART_SetNbDataToProcess(hal_usart_handle_t *husart);
#endif /* USE_HAL_USART_FIFO */

