MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
static void USART_EndTransmit_IT(hal_usart_handle_t *husart);

static hal_status_t USART_Start_Transmit_IT(hal_usart_handle_t *husart, const uint8_t *p_data, uint32_t size,
                                            uint32_t interrupts);
static hal_status_t USART_Start_Receive_IT(hal_usart_handle_t *husart, uint8_t *p_data, uint32_t size,
                                           uint32_t interrupts);
static hal_status_t USART_Start_TransmitReceive_IT(hal_usart_handle_t *husart, const uint8_t *p_tx_data,
                                                   uint8_t *p_rx_data, uint32_t size, uint32_t interrupts);
#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
static hal_status_t USART_Start_Transmit_DMA(hal_usart_handle_t *husart, const uint8_t *p_data, uint32_t size,
                                             uint32_t interrupts);
static hal_status_t USART_Start_Receive_DMA(hal_usart_handle_t *husart, uint8_t *p_data, uint32_t size,
                                            uint32_t interrupts);
static hal_status_t USART_Start_TransmitReceive_DMA(hal_usart_handle_t *husart, const uint8_t *p_tx_data,
                                                    uint8_t *p_rx_data, uint32_t size, uint32_t interrupts);
#endif /* USE_HAL_USART_DMA */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup USART_Exported_Functions
  * @{
  */

/** @addtogroup USART_Exported_Functions_Group1
  * @{
This subsection provides a set of functions to initialize and deinitialize the USART in
synchronous mode.
  - Call the function HAL_USART_Init() to initialize the selected USART handle and associate an instance.
  - Call the function HAL_USART_DeInit() to deinitialize the given HAL USART instance by stopping any ongoing process
  and resetting the state machine.
  */

/**
  * @brief Initialize the USART handler for the associated instance.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which will contain the USART instance.
  * @param instance USART instance.
  * @retval HAL_OK USART instance has been correctly initialized.
  * @retval HAL_INVALID_PARAM USART instance is NULL.
  * @retval HAL_ERROR USART semaphore creation failed (USE_HAL_MUTEX is set to 1).
  */
hal_status_t HAL_USART_Init(hal_usart_handle_t *husart, hal_usart_t instance)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_INSTANCE((USART_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (husart == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->instance = instance;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  USART_InitCallbacksToDefault(husart);
#endif /* (USE_HAL_USART_REGISTER_CALLBACKS) */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  /* Initialize the number of data to process during RX/TX ISR execution */
  husart->nb_tx_data_to_process = 1;
  husart->nb_rx_data_to_process = 1;
  husart->fifo_mode = HAL_USART_FIFO_MODE_DISABLED;
#endif /* USE_HAL_USART_FIFO */

#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
  husart->hdma_tx = (hal_dma_handle_t *) NULL;
  husart->hdma_rx = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_USART_DMA */

#if defined (USE_HAL_USART_USER_DATA) && (USE_HAL_USART_USER_DATA == 1)
  /* Reset the user data pointer to NULL */
  husart->p_user_data = NULL;
#endif /* USE_HAL_USART_USER_DATA */

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  husart->last_error_codes = 0;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */

#if defined(USE_HAL_USART_CLK_ENABLE_MODEL) && (USE_HAL_USART_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  USART_EnableClock(husart);
#endif /* USE_HAL_USART_CLK_ENABLE_MODEL */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Create the USART semaphore */
  if (HAL_OS_SemaphoreCreate(&husart->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  husart->global_state = HAL_USART_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief Deinitialize the USART handler, reset the flags, states, and counters.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
void HAL_USART_DeInit(hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
  ASSERT_DBG_PARAM(IS_USART_INSTANCE(p_usartx));

  const hal_usart_state_t temp_state = husart->global_state;

  if ((temp_state == HAL_USART_STATE_RX_ACTIVE) || (temp_state == HAL_USART_STATE_TX_ACTIVE)
      || (temp_state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    husart->global_state = HAL_USART_STATE_ABORT;
    USART_Abort(husart);
  }

  LL_USART_Disable(p_usartx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&husart->semaphore);
#endif /* USE_HAL_MUTEX  */

  husart->global_state = HAL_USART_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group2
  * @{
This subsection provides a set of functions to configure the USART in synchronous mode.
  - Call HAL_USART_SetConfig() to configure the initialized instance with a set of parameters containing:
    - baud rate
    - Prescaler
    - Word Length
    - Stop Bits
    - Parity: If the parity is enabled, then the MSB bit of the data written in the data register is transmitted but
    is changed by the parity bit.
    - Direction (Receiver/Transmitter)
    - Clock polarity
    - Clock phase
    - Last Bit Clock Pulse
    - Mode (Slave or Master)
  - Call HAL_USART_GetConfig() to retrieve the current configuration (not mandatory)
  - If needed, after calling HAL_USART_SetConfig(), modify the configuration using unitary configuration
  functions:
    - HAL_USART_SetBaudRate()
    - HAL_USART_SetStopBits()
    - HAL_USART_SetWordLength()
    - HAL_USART_SetParity()
    - HAL_USART_SetXferDirection()
    - HAL_USART_SetClockPolarity()
    - HAL_USART_SetClockPhase()
    - HAL_USART_SetLastBitClockPulse()
    - HAL_USART_SetMode()

