MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  @warning
    - __Prescaler__: cannot be modified with a unitary configuration function as it impacts other parameters. Call
    HAL_USART_SetConfig() to modify it.

  - If needed, retrieve the different parameters by calling:
    - HAL_USART_GetBaudRate()
    - HAL_USART_GetStopBits()
    - HAL_USART_GetWordLength()
    - HAL_USART_GetParity()
    - HAL_USART_GetXferDirection()
    - HAL_USART_GetClockPolarity()
    - HAL_USART_GetClockPhase()
    - HAL_USART_GetLastBitClockPulse()
    - HAL_USART_GetMode()

  @warning
    - __Prescaler__: As there is no unitary configuration function for this parameter, there is no unitary
    getter as well.
  - Possible frame format:
    Depending on the frame length defined by the M1 and M0 bits (7-bit,
    8-bit or 9-bit), the possible USART formats are listed in the
    following table.

~~~
  USART frame format.
    +-----------------------------------------------------------------------+
    |  M1 bit |  M0 bit |  PCE bit  |             USART frame               |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    0    |    0      |    | SB |    8 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    0    |    1      |    | SB | 7 bit data | PB | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    1    |    0      |    | SB |    9 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    1    |    1      |    | SB | 8 bit data | PB | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    1    |    0    |    0      |    | SB |    7 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    1    |    0    |    1      |    | SB | 6 bit data | PB | STB |     |
    +-----------------------------------------------------------------------+
  Acronym definition :
  - STB (Stop Bit)
  - SB (Start Bit)
  - PB (Parity Bit)
~~~
  */

/**
  * @brief Set the basic configuration to enable the use of the USART instance.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param p_config Pointer to a hal_usart_config_t structure containing the USART configuration.
  * @retval HAL_OK USART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  * @retval HAL_ERROR Error during instance enabling or kernel clock not enabled.
  */
hal_status_t HAL_USART_SetConfig(hal_usart_handle_t *husart, const hal_usart_config_t *p_config)
{
  USART_TypeDef *p_usartx;
  uint32_t instance_clock_freq;
  uint32_t div_temp;
  uint32_t brr_temp;
  uint32_t cr1_config;
  uint32_t cr2_config;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_USART_PRESCALER(p_config->clock_prescaler));
  ASSERT_DBG_PARAM(IS_USART_BAUD_RATE(p_config->baud_rate));
  ASSERT_DBG_PARAM(IS_USART_WORD_LENGTH(p_config->word_length));
  ASSERT_DBG_PARAM(IS_USART_STOP_BITS(p_config->stop_bits));
  ASSERT_DBG_PARAM(IS_USART_PARITY(p_config->parity));
  ASSERT_DBG_PARAM(IS_USART_DIRECTION(p_config->direction));
  ASSERT_DBG_PARAM(IS_USART_CLOCK_POLARITY(p_config->clock_polarity));
  ASSERT_DBG_PARAM(IS_USART_CLOCK_PHASE(p_config->clock_phase));
  ASSERT_DBG_PARAM(IS_USART_CLOCK_LAST_BIT(p_config->clock_last_bit));
  ASSERT_DBG_PARAM(IS_USART_MODE(p_config->mode));

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));
  p_usartx = USART_GET_INSTANCE(husart);

  LL_USART_Disable(p_usartx);

  if (p_config->mode == HAL_USART_MODE_SLAVE)
  {
    LL_USART_ConfigSyncSlaveMode(p_usartx);
  }
  else
  {
    LL_USART_ConfigSyncMasterMode(p_usartx);
  }
  husart->usart_mode = p_config->mode;

  cr1_config = ((uint32_t)p_config->word_length | (uint32_t)p_config->parity
                | (uint32_t)p_config->direction | LL_USART_OVERSAMPLING_8);

  cr2_config = ((uint32_t)p_config->stop_bits | (uint32_t)p_config->clock_polarity
                | (uint32_t)p_config->clock_phase | (uint32_t)p_config->clock_last_bit);

  LL_USART_ConfigXfer(p_usartx, cr1_config, cr2_config);

  LL_USART_SetPrescaler(p_usartx, (uint32_t)p_config->clock_prescaler);

  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_usartx);
  if (instance_clock_freq == 0U)
  {
    return HAL_ERROR;
  }

  div_temp = LL_USART_DIV_SAMPLING8(instance_clock_freq, (uint32_t)p_config->clock_prescaler, p_config->baud_rate);
  ASSERT_DBG_PARAM((div_temp >= USART_BRR_MIN) && (div_temp <= USART_BRR_MAX));
  brr_temp = div_temp & 0xFFF0U;
  brr_temp |= (uint16_t)((div_temp & (uint16_t)0x000FU) >> 1U);
  div_temp = brr_temp;

  LL_USART_WRITE_REG(p_usartx, BRR, (uint16_t)div_temp);

  husart->global_state = HAL_USART_STATE_IDLE;

  /* Enable USART instance */
  if (USART_CheckEnabledState(husart) != HAL_OK)
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}
/**
  * @brief Get the current basic configuration set in the current USART instance.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param p_config Pointer to a hal_usart_config_t structure to store the USART configuration.
  */
void HAL_USART_GetConfig(const hal_usart_handle_t *husart, hal_usart_config_t *p_config)
{
  USART_TypeDef *p_usartx;
  uint32_t reg_temp;
  uint32_t instance_clock_freq;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);
  p_config->word_length = (hal_usart_word_length_t)(uint32_t)
                          (reg_temp & (LL_USART_DATAWIDTH_7_BIT | LL_USART_DATAWIDTH_9_BIT));
  p_config->parity = (hal_usart_parity_t)(uint32_t)(reg_temp & (LL_USART_PARITY_ODD));
  p_config->direction = (hal_usart_direction_t)(uint32_t)(reg_temp & (LL_USART_DIRECTION_TX_RX));

  reg_temp = LL_USART_READ_REG(p_usartx, CR2);

  p_config->stop_bits = (hal_usart_stop_bits_t)(uint32_t)(reg_temp & (LL_USART_STOP_BIT_1_5));
  p_config->clock_polarity = (hal_usart_clock_polarity_t)(uint32_t)(reg_temp & (LL_USART_CLOCK_POLARITY_HIGH));
  p_config->clock_phase = (hal_usart_clock_phase_t)(uint32_t)(reg_temp & (LL_USART_CLOCK_PHASE_2_EDGE));
  p_config->clock_last_bit = (hal_usart_clock_last_bit_state_t)(uint32_t)(reg_temp & (LL_USART_LASTCLKPULSE_ENABLED));

  p_config->clock_prescaler = (hal_usart_prescaler_t)LL_USART_GetPrescaler(p_usartx);

  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq(p_usartx);
  p_config->baud_rate = LL_USART_GetBaudRate(p_usartx, instance_clock_freq, (uint32_t)p_config->clock_prescaler,
                                             LL_USART_OVERSAMPLING_8);
  if (LL_USART_IsEnabledSPISlave(p_usartx) != 0U)
  {
    p_config->mode = HAL_USART_MODE_SLAVE;
  }
  else
  {
    p_config->mode = HAL_USART_MODE_MASTER;
  }
}

/**
  * @brief Set the Word Length configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param word_length Word length to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetWordLength(const hal_usart_handle_t *husart, hal_usart_word_length_t word_length)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_WORD_LENGTH(word_length));

