MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetDataWidth(p_usartx, (uint32_t)word_length);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Word Length configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_word_length_t Current Word length configuration.
  */
hal_usart_word_length_t HAL_USART_GetWordLength(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_word_length_t)LL_USART_GetDataWidth(p_usartx);
}

/**
  * @brief Set the Parity configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param parity Parity to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetParity(const hal_usart_handle_t *husart, hal_usart_parity_t parity)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_PARITY(parity));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetParity(p_usartx, (uint32_t)parity);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Parity configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_parity_t Current Parity configuration.
  */
hal_usart_parity_t HAL_USART_GetParity(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_parity_t)LL_USART_GetParity(p_usartx);
}

/**
  * @brief Set the Stop Bits configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param stop_bits Stop Bits to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetStopBits(const hal_usart_handle_t *husart, hal_usart_stop_bits_t stop_bits)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_STOP_BITS(stop_bits));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetStopBitsLength(p_usartx, (uint32_t)stop_bits);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Stop Bits configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_stop_bits_t Current Stop Bits configuration.
  */
hal_usart_stop_bits_t HAL_USART_GetStopBits(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_stop_bits_t)LL_USART_GetStopBitsLength(p_usartx);
}

/**
  * @brief Set the XFer Direction configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param xfer_direction XFer Direction to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetXferDirection(const hal_usart_handle_t *husart, hal_usart_direction_t xfer_direction)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_DIRECTION(xfer_direction));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  LL_USART_SetTransferDirection(p_usartx, (uint32_t)xfer_direction);

  return HAL_OK;
}

/**
  * @brief Get the XFer Direction configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_direction_t Current XFer Direction configuration.
  */
hal_usart_direction_t HAL_USART_GetXferDirection(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_direction_t)LL_USART_GetTransferDirection(p_usartx);
}

/**
  * @brief Set the Clock polarity configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param clock_polarity Clock polarity to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetClockPolarity(const hal_usart_handle_t *husart, hal_usart_clock_polarity_t clock_polarity)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_CLOCK_POLARITY(clock_polarity));

