MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetClockPolarity(p_usartx, (uint32_t)clock_polarity);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Clock polarity configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_clock_polarity_t Current Clock polarity configuration.
  */
hal_usart_clock_polarity_t HAL_USART_GetClockPolarity(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_clock_polarity_t)LL_USART_GetClockPolarity(p_usartx);
}

/**
  * @brief Set the Clock phase configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param clock_phase Clock phase to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetClockPhase(const hal_usart_handle_t *husart, hal_usart_clock_phase_t clock_phase)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_CLOCK_PHASE(clock_phase));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetClockPhase(p_usartx, (uint32_t)clock_phase);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Clock phase configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_clock_phase_t Current Clock phase configuration.
  */
hal_usart_clock_phase_t HAL_USART_GetClockPhase(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_clock_phase_t)LL_USART_GetClockPhase(p_usartx);
}

/**
  * @brief Set the last bit clock pulse configuration set as parameter into the handler instance registers
  *        (used in USART Synchronous SPI master mode only).
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param clock_last_bit Last bit clock pulse configuration to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetLastBitClockPulse(const hal_usart_handle_t *husart,
                                            hal_usart_clock_last_bit_state_t clock_last_bit)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_CLOCK_LAST_BIT(clock_last_bit));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetLastClkPulseOutput(p_usartx, (uint32_t)clock_last_bit);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the last bit clock pulse configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_clock_last_bit_state_t Current last bit clock pulse configuration.
  */
hal_usart_clock_last_bit_state_t HAL_USART_GetLastBitClockPulse(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  return (hal_usart_clock_last_bit_state_t)LL_USART_GetLastClkPulseOutput(p_usartx);
}

/**
  * @brief Set the baud rate configuration from the parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param baud_rate Baud rate value to set.
  * @retval HAL_OK USART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM Required baud rate value cannot be set with the current configuration.
  */
hal_status_t HAL_USART_SetBaudRate(const hal_usart_handle_t *husart, uint32_t baud_rate)
{
  USART_TypeDef *p_usartx;
  uint32_t instance_clock_freq;
  uint32_t div_temp;
  uint32_t brr_temp;
  uint32_t instance_clock_prescaler;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_BAUD_RATE(baud_rate));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);
  instance_clock_freq = HAL_RCC_USART_GetKernelClkFreq((USART_TypeDef *)((uint32_t)(husart->instance)));
  instance_clock_prescaler = LL_USART_GetPrescaler(p_usartx);

  div_temp = LL_USART_DIV_SAMPLING8(instance_clock_freq, instance_clock_prescaler, baud_rate);
  ASSERT_DBG_PARAM((div_temp >= USART_BRR_MIN) && (div_temp <= USART_BRR_MAX));
  brr_temp = div_temp & 0xFFF0U;
  brr_temp |= (uint16_t)((div_temp & (uint16_t)0x000FU) >> 1U);
  div_temp = brr_temp;

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_WRITE_REG(p_usartx, BRR, div_temp);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the baud rate configuration from the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval uint32_t Current baud rate value.
  */
uint32_t HAL_USART_GetBaudRate(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;
  uint32_t instance_clock_freq;
  uint32_t prescaler;

  ASSERT_DBG_PARAM(husart != NULL);

