MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);
  instance_clock_freq = HAL_USART_GetClockFreq(husart);

  prescaler = LL_USART_GetPrescaler(p_usartx);
  return LL_USART_GetBaudRate(p_usartx, instance_clock_freq, prescaler, LL_USART_OVERSAMPLING_8);
}

/**
  * @brief  Set the Mode configuration set as parameter into the handler instance registers.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  mode Mode value to set.
  * @warning When the USART operates in SPI slave mode, it handles data flow using
  *          the serial interface clock derived from the external SCLK signal
  *          provided by the external master SPI device.
  * @warning In SPI slave mode, the USART must be enabled before starting the master
  *          communications (or between frames while the clock is stable). Otherwise,
  *          if the USART slave is enabled while the master is in the middle of a
  *          frame, it will become desynchronized with the master.
  * @warning The data register of the slave needs to be ready before the first edge
  *          of the communication clock or before the end of the ongoing communication,
  *          otherwise the SPI slave will transmit zeros.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetMode(hal_usart_handle_t *husart, hal_usart_mode_t mode)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_MODE(mode));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  if (mode == HAL_USART_MODE_SLAVE)
  {
    LL_USART_ConfigSyncSlaveMode(p_usartx);
  }
  else
  {
    LL_USART_ConfigSyncMasterMode(p_usartx);
  }
  husart->usart_mode = mode;
  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Mode configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_mode_t Current mode value.
  */
hal_usart_mode_t HAL_USART_GetMode(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  if (LL_USART_IsEnabledSPISlave(p_usartx) != 0U)
  {
    return HAL_USART_MODE_SLAVE;
  }
  else
  {
    return HAL_USART_MODE_MASTER;
  }
}
/**
  * @}
  */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/** @addtogroup USART_Exported_Functions_Group3
  * @{
  This subsection provides a set of functions to use the FIFO mode feature for the USARTx instance.
  Before using the FIFO mode feature, configure the instance in synchronous
  mode with HAL_USART_SetConfig(). All these functions are available only if USE_HAL_USART_FIFO is set to 1.
  A set of functions is provided to use the FIFO mode feature:
    - HAL_USART_EnableFifoMode(): Enable the FIFO mode feature
    - HAL_USART_DisableFifoMode(): Disable the FIFO mode feature
    - HAL_USART_IsEnabledFifoMode(): Check if the FIFO mode feature is enabled
    - HAL_USART_SetTxFifoThreshold(): Set the configuration of the Tx FIFO
    - HAL_USART_GetTxFifoThreshold(): Retrieve the configuration of the Tx FIFO
    - HAL_USART_SetRxFifoThreshold(): Set the configuration of the Rx FIFO
    - HAL_USART_GetRxFifoThreshold(): Retrieve the configuration of the Rx FIFO

  The feature is designed to be used following the procedure:
    - HAL_USART_SetTxFifoThreshold()
    - HAL_USART_SetRxFifoThreshold()
    - HAL_USART_EnableFifoMode()
    - Start a process, e.g.: HAL_USART_Receive()
  */

/**
  * @brief Enable the FIFO into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_EnableFifoMode(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_EnableFIFO(p_usartx);

  husart->fifo_mode = HAL_USART_FIFO_MODE_ENABLED;

  /* Update Tx and Rx numbers of data to process */
  USART_SetNbDataToProcess(husart);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Disable the FIFO into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_DisableFifoMode(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_DisableFIFO(p_usartx);

  husart->fifo_mode = HAL_USART_FIFO_MODE_DISABLED;

  /* Update Tx and Rx numbers of data to process */
  USART_SetNbDataToProcess(husart);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Return the FIFO status according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_fifo_mode_status_t Current FIFO status.
  */
hal_usart_fifo_mode_status_t HAL_USART_IsEnabledFifoMode(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

