MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  return (hal_usart_fifo_mode_status_t)LL_USART_IsEnabledFIFO(p_usartx);
}

/**
  * @brief Set the Transmit FIFO Threshold configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param tx_fifo_threshold Transmit FIFO Threshold to applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetTxFifoThreshold(hal_usart_handle_t *husart, hal_usart_fifo_threshold_t tx_fifo_threshold)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

  ASSERT_DBG_PARAM(IS_USART_FIFO_THRESHOLD(tx_fifo_threshold));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetTXFIFOThreshold(p_usartx, (uint32_t)tx_fifo_threshold);

  /* Update Tx numbers of data to process */
  USART_SetNbDataToProcess(husart);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Transmit FIFO Threshold configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_fifo_threshold_t Current Transmit FIFO Threshold configuration.
  */
hal_usart_fifo_threshold_t HAL_USART_GetTxFifoThreshold(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  return (hal_usart_fifo_threshold_t) LL_USART_GetTXFIFOThreshold(p_usartx);
}

/**
  * @brief Set the Receive FIFO Threshold configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param rx_fifo_threshold Receive FIFO Threshold to applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetRxFifoThreshold(hal_usart_handle_t *husart, hal_usart_fifo_threshold_t rx_fifo_threshold)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

  ASSERT_DBG_PARAM(IS_USART_FIFO_THRESHOLD(rx_fifo_threshold));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  LL_USART_SetRXFIFOThreshold(p_usartx, (uint32_t)rx_fifo_threshold);

  /* Update Rx numbers of data to process */
  USART_SetNbDataToProcess(husart);

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Receive FIFO Threshold configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_fifo_threshold_t Current Receive FIFO Threshold configuration.
  */
hal_usart_fifo_threshold_t HAL_USART_GetRxFifoThreshold(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

  p_usartx = USART_GET_INSTANCE(husart);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  return (hal_usart_fifo_threshold_t) LL_USART_GetRXFIFOThreshold(p_usartx);
}

/**
  * @}
  */

#endif /* USE_HAL_USART_FIFO */

/** @addtogroup USART_Exported_Functions_Group5
  * @{
  This subsection provides a set of functions to configure advanced features for the USARTx instance.
  Note that advanced features might not be supported on all instances.
  Before configuring advanced features, configure the instance in synchronous
  mode with HAL_USART_SetConfig().

  Configure some features by calling the associated functions:
    - HAL_USART_SetSlaveSelect(): Set the slave select to software or hardware using the USART NSS pin
    - HAL_USART_GetSlaveSelect(): Get the slave select configuration using the USART NSS pin
  */
/**
  * @brief Set the Slave select configuration set as parameter into the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param slave_select Slave select to be applied.
  * @retval HAL_OK USART instance has been correctly configured.
  */
hal_status_t HAL_USART_SetSlaveSelect(const hal_usart_handle_t *husart, hal_usart_slave_select_config_t slave_select)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_SLAVE_SELECT_CONFIG(slave_select));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  USART_ENSURE_INSTANCE_DISABLED(p_usartx);

  if (slave_select == HAL_USART_SLAVE_SELECT_PIN_USED)
  {
    LL_USART_EnableSPISlaveSelect(p_usartx);
  }
  else
  {
    LL_USART_DisableSPISlaveSelect(p_usartx);
  }

  USART_ENSURE_INSTANCE_ENABLED(p_usartx);

  return HAL_OK;
}

/**
  * @brief Get the Slave select configuration according to the handler instance registers.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_slave_select_config_t Current Slave select configuration.
  */
hal_usart_slave_select_config_t HAL_USART_GetSlaveSelect(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);

