MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                                                    | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE
                                                    | HAL_USART_STATE_ABORT));

  p_usartx = USART_GET_INSTANCE(husart);

  /* condition inverted in LL */
  if (LL_USART_IsEnabledSPISlaveSelect(p_usartx) != 1U)
  {
    return HAL_USART_SLAVE_SELECT_PIN_IGNORED;
  }
  else
  {
    return HAL_USART_SLAVE_SELECT_PIN_USED;
  }
}

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group6 DMA Configuration functions
  * @{
  This subsection provides a set of functions to link the HAL USART handle to a Tx and Rx DMA handler
  for the USARTx instance.
  A set of functions is provided to use the DMA feature:
    - HAL_USART_SetTxDMA(): Link a DMA instance to the Tx channel
    - HAL_USART_SetRxDMA(): Link a DMA instance to the Rx channel
  */
#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
/**
  * @brief Set DMA channel for transmission.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param hdma_tx Pointer to a hal_dma_handle_t structure that contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_tx is NULL.
  */
hal_status_t HAL_USART_SetTxDMA(hal_usart_handle_t *husart, hal_dma_handle_t *hdma_tx)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(hdma_tx != NULL);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_tx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->hdma_tx = hdma_tx;
  hdma_tx->p_parent = husart;

  return HAL_OK;
}

/**
  * @brief Set DMA channel for Reception.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param hdma_rx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_rx is NULL.
  */
hal_status_t HAL_USART_SetRxDMA(hal_usart_handle_t *husart, hal_dma_handle_t *hdma_rx)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(hdma_rx != NULL);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_rx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->hdma_rx = hdma_rx;
  hdma_rx->p_parent = husart;

  return HAL_OK;
}
#endif /* USE_HAL_USART_DMA */

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group7 Callbacks Register functions
  * @{
  This subsection provides a set of functions to configure the callbacks for the USARTx instance.
  Before configuring the callbacks, configure the instance in synchronous
  mode with HAL_USART_SetConfig().
  A set of functions is provided to configure the callbacks:
    - HAL_USART_RegisterTxHalfCpltCallback(): Set the Tx half complete callback
    - HAL_USART_RegisterTxCpltCallback(): Set the Tx complete callback
    - HAL_USART_RegisterRxHalfCpltCallback(): Set the Rx half complete callback
    - HAL_USART_RegisterRxCpltCallback(): Set the Rx complete callback
    - HAL_USART_RegisterTxRxCpltCallback(): Set the TxRx complete callback
    - HAL_USART_RegisterErrorCallback(): Set the error callback
    - HAL_USART_RegisterAbortCpltCallback(): Set the abort complete callback
    - HAL_USART_RegisterRxFifoFullCallback(): Set the Rx FIFO full callback
    - HAL_USART_RegisterTxFifoEmptyCallback(): Set the Tx FIFO empty callback
  */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)

/**
  * @brief  Register the USART Tx Half Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback Pointer to the Tx Half Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterTxHalfCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_tx_half_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Tx Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Tx Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterTxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_tx_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Rx Half Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Rx Half Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterRxHalfCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_rx_half_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Rx Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Rx Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterRxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

