MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  husart->p_rx_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Tx/Rx Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Rx Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterTxRxCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_tx_rx_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Error Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Error Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterErrorCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_error_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the USART Abort Complete Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Abort Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterAbortCpltCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_abort_cplt_callback = p_callback;

  return HAL_OK;
}

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief  Register the USART Rx Fifo Full Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Rx Fifo Full Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterRxFifoFullCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_rx_fifo_full_callback = p_callback;

  return HAL_OK;
}
/**
  * @brief  Register the USART Tx Fifo Empty Callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_callback pointer to the Tx Fifo Empty Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_USART_RegisterTxFifoEmptyCallback(hal_usart_handle_t *husart, hal_usart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(husart->global_state, (uint32_t)(HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  husart->p_tx_fifo_empty_callback = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_USART_FIFO */
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group8 IO operation functions
  *  @{
    This subsection provides a set of functions to manage the USART synchronous
      data transfers.

  The USART Synchronous SPI supports master and slave modes.
  In Master mode, SCLK is always an output, and is generated by transmission. This means that in order
  to achieve a reception in Master mode, a transmission (0x0F) must be performed simultaneously (full duplex).
  In Slave mode, SCLK is an input.

  There are two modes of transfer:
    - Blocking mode: The communication is performed in polling mode.
      The HAL status of all data processing is returned by the same function
      after finishing transfer.
    - Non-Blocking mode: The communication is performed using interrupts
      or DMA. These APIs return the HAL status.
      The end of the data processing will be indicated through the
      dedicated USART IRQ when using Interrupt mode or the DMA IRQ when
      using DMA mode.
      The HAL_USART_TxCpltCallback(), HAL_USART_RxCpltCallback() and HAL_USART_TxRxCpltCallback() user callbacks
      are executed respectively at the end of the transmit or receive process.
      The HAL_USART_ErrorCallback() user callback is executed when a communication error is detected.

  Blocking mode APIs are:
    - HAL_USART_Transmit()
    - HAL_USART_Receive()
    - HAL_USART_TransmitReceive()

  Non-Blocking mode APIs with Interrupt are:
    - HAL_USART_Transmit_IT()
    - HAL_USART_Transmit_IT_Opt()
    - HAL_USART_Receive_IT()
    - HAL_USART_Receive_IT_Opt()
    - HAL_USART_TransmitReceive_IT()
    - HAL_USART_TransmitReceive_IT_Opt()
    - HAL_USART_IRQHandler()

  Non-Blocking mode APIs with DMA are:
    - HAL_USART_Transmit_DMA()
    - HAL_USART_Transmit_DMA_Opt()
    - HAL_USART_Receive_DMA()
    - HAL_USART_Receive_DMA_Opt()
    - HAL_USART_TransmitReceive_DMA()
    - HAL_USART_TransmitReceive_DMA_Opt()
    - HAL_USART_Pause_DMA()
    - HAL_USART_Resume_DMA()

  A set of Transfer Complete Callbacks are provided in Non-Blocking mode:
    - HAL_USART_TxCpltCallback()
    - HAL_USART_RxCpltCallback()
    - HAL_USART_TxHalfCpltCallback()
    - HAL_USART_RxHalfCpltCallback()
    - HAL_USART_TxFifoEmptyCallback()
    - HAL_USART_RxFifoFullCallback()
    - HAL_USART_ErrorCallback()
    - HAL_USART_TxRxCpltCallback()

  Non-Blocking mode transfers can be aborted using Abort APIs:
    - HAL_USART_Abort()
    - HAL_USART_Abort_IT()

  For abort services based on interrupts (HAL_USART_Abort_IT()), an Abort Complete Callback is provided:
    - HAL_USART_AbortCpltCallback()

  In Non-Blocking mode transfers, possible errors are split into 2 categories.
  - Error is considered recoverable and non-blocking: transfer can proceed to the end, but error severity is
    evaluated by the user:
    - If Parity Error flag is detected in interrupt mode reception: Received character is then retrieved and stored
      in Rx buffer. Error code is set to allow the user to identify the error type. HAL_USART_ErrorCallback() user
      callback is then executed.
  - Error is considered blocking: transfer cannot be completed properly and is aborted.
    - If global state is HAL_USART_STATE_RX_ACTIVE: This concerns Overrun Error in Interrupt mode and all errors
      in DMA mode.
    - If global state is HAL_USART_STATE_TX_ACTIVE: This concerns Underrun Error in Interrupt mode and in DMA mode.
    - If global state is HAL_USART_STATE_TX_RX_ACTIVE: This concerns Overrun Error in Interrupt mode and in DMA mode.
    In all cases, HAL_USART_ErrorCallback() user callback is executed and error code is set to allow the user to
    identify the error type if USE_HAL_USART_GET_LAST_ERRORS=1.
  */

/**
  * @brief  Send an amount of data in blocking mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to data buffer.
  * @param  size_byte         Amount of bytes to be sent.
  * @param  timeout_ms        Timeout duration.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_Transmit(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte,
                                uint32_t timeout_ms)
{
  const uint8_t  *p_data_8_bits;
  const uint16_t *p_data_16_bits;
  uint32_t tick_start;
  uint32_t reg_temp;
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

