MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_usartx = USART_GET_INSTANCE(husart);

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_ACTIVE);

  /* Ensure Instance is ready */
  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }
  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    p_data_16_bits = (const uint16_t *)p_data;
    p_data_8_bits = NULL;
  }
  else
  {
    p_data_8_bits = (const uint8_t *)p_data;
    p_data_16_bits = NULL;
  }

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  husart->tx_xfer_size = size_byte;
  husart->tx_xfer_count = size_byte;

  /* Check the remaining data to be sent */
  while (husart->tx_xfer_count > 0U)
  {
    if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_TXE_TXFNF, 0U, tick_start, timeout_ms) != HAL_OK)
    {
      husart->global_state = HAL_USART_STATE_IDLE;
      return HAL_TIMEOUT;
    }
    if (p_data_8_bits == NULL)
    {
      LL_USART_TransmitData9(p_usartx, *p_data_16_bits);
      p_data_16_bits++;
    }
    else
    {
      LL_USART_TransmitData8(p_usartx, *p_data_8_bits);
      p_data_8_bits++;
    }
    husart->tx_xfer_count--;
  }

  if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_TC, 0U, tick_start, timeout_ms) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  /* Clear Transmission Complete Flag */
  LL_USART_ClearFlag_TC(p_usartx);

  /* Clear overrun flag and discard the received data */
  LL_USART_ClearFlag_ORE(p_usartx);
  LL_USART_SetRequest(p_usartx, LL_USART_REQUEST_RX_DATA_FLUSH);
  LL_USART_SetRequest(p_usartx, LL_USART_REQUEST_TX_DATA_FLUSH);

  /* At end of Tx process, restore husart->global_state to Idle */
  husart->global_state = HAL_USART_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Receive an amount of data in blocking mode.
  * @param husart             Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be received.
  * @param timeout_ms         Timeout duration.
  * @warning If USART is configured in Master mode, to receive synchronous data, dummy data are simultaneously
  *         transmitted.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_Receive(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte, uint32_t timeout_ms)
{
  uint8_t  *p_data_8_bits;
  uint16_t *p_data_16_bits;
  uint16_t uh_mask;
  uint32_t tick_start;
  uint32_t reg_temp;
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_usartx = USART_GET_INSTANCE(husart);
  /* Ensure Instance is enabled */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    p_data_16_bits = (uint16_t *)p_data;
    p_data_8_bits = NULL;
  }
  else
  {
    p_data_8_bits = (uint8_t *)p_data;
    p_data_16_bits = NULL;
  }


  /* Init tickstart for timeout management */
  tick_start = HAL_GetTick();

  husart->rx_xfer_size  = size_byte;
  husart->rx_xfer_count = size_byte;

  /* Computation of USART mask to apply to RDR register */
  if (USART_RDRMaskComputation(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }
  uh_mask = husart->rdr_register_mask;

  /* As long as data have to be received */
  while (husart->rx_xfer_count > 0U)
  {
    if (husart->usart_mode == HAL_USART_MODE_MASTER)
    {
      /* Wait until TXE flag is set to send dummy byte in order to generate the
      * clock for the slave to send data.
      * Whatever the frame length (7, 8 or 9-bit long), the same dummy value
      * can be written for all the cases. */
      if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_TXE_TXFNF, 0U, tick_start, timeout_ms) != HAL_OK)
      {
        husart->global_state = HAL_USART_STATE_IDLE;
        return HAL_TIMEOUT;
      }
      LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
    }

    /* Wait for RXNE Flag */
    if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_RXNE_RXFNE, 0U, tick_start, timeout_ms) != HAL_OK)
    {
      husart->global_state = HAL_USART_STATE_IDLE;
      return HAL_TIMEOUT;
    }

    if (p_data_8_bits == NULL)
    {
      *p_data_16_bits = LL_USART_ReceiveData9(p_usartx) & uh_mask;
      p_data_16_bits++;
    }
    else
    {
      *p_data_8_bits = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_usartx) & uh_mask);
      p_data_8_bits++;
    }

    husart->rx_xfer_count--;

  }

  /* Clear SPI slave underrun flag and discard transmit data */
  if (husart->usart_mode == HAL_USART_MODE_SLAVE)
  {
    LL_USART_ClearFlag_UDR(p_usartx);
    LL_USART_SetRequest(p_usartx, LL_USART_REQUEST_TX_DATA_FLUSH);
  }

