MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  /* At end of Rx process, restore husart->global_state to Idle */
  husart->global_state = HAL_USART_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Full-duplex send and receive an amount of data in blocking mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_tx_data         Pointer to TX data buffer.
  * @param  p_rx_data         Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be sent (same amount to be received).
  * @param  timeout_ms        Timeout duration.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data and the received data are handled as sets of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_TransmitReceive(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                       uint32_t size_byte, uint32_t timeout_ms)
{
  uint8_t  *p_rx_data_8_bits;
  const uint8_t  *p_tx_data_8_bits;
  uint16_t *p_rx_data_16_bits;
  const uint16_t *p_tx_data_16_bits;
  USART_TypeDef *p_usartx;
  uint16_t uh_mask;
  uint32_t rx_data_count;
  uint32_t tick_start;
  uint32_t reg_temp;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_usartx = USART_GET_INSTANCE(husart);

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    p_rx_data_16_bits = (uint16_t *)p_rx_data;
    p_tx_data_16_bits = (const uint16_t *)p_tx_data;
    p_rx_data_8_bits = NULL;
    p_tx_data_8_bits = NULL;
  }
  else
  {
    p_rx_data_8_bits = (uint8_t *)p_rx_data;
    p_tx_data_8_bits = (const uint8_t *)p_tx_data;
    p_rx_data_16_bits = NULL;
    p_tx_data_16_bits = NULL;
  }

  /* Init tickstart for timeout management */
  tick_start = HAL_GetTick();

  husart->rx_xfer_size = size_byte;
  husart->rx_xfer_count = size_byte;
  husart->tx_xfer_size = size_byte;
  husart->tx_xfer_count = size_byte;

  /* Computation of USART mask to apply to RDR register */
  if (USART_RDRMaskComputation(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }
  uh_mask = husart->rdr_register_mask;

  if ((husart->tx_xfer_count == 0x01U) || (husart->usart_mode == HAL_USART_MODE_SLAVE))
  {
    /* Wait until TXE flag is set to send data */
    if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_TXE_TXFNF, 0U, tick_start, timeout_ms) != HAL_OK)
    {
      husart->global_state = HAL_USART_STATE_IDLE;
      return HAL_TIMEOUT;
    }
    if (p_tx_data_8_bits == NULL)
    {
      LL_USART_TransmitData9(p_usartx, (*p_tx_data_16_bits & uh_mask));
      p_tx_data_16_bits++;
    }
    else
    {
      LL_USART_TransmitData8(p_usartx, (*p_tx_data_8_bits & (uint8_t)(uh_mask & 0xFFU)));
      p_tx_data_8_bits++;
    }

    husart->tx_xfer_count--;
  }

  /* Check the remain data to be sent */
  rx_data_count = husart->rx_xfer_count;
  while ((husart->rx_xfer_count > 0U) || (rx_data_count > 0U))
  {
    if (husart->tx_xfer_count > 0U)
    {
      /* Wait until TXE flag is set to send data */
      if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_TXE_TXFNF, 0U, tick_start, timeout_ms) != HAL_OK)
      {
        husart->global_state = HAL_USART_STATE_IDLE;
        return HAL_TIMEOUT;
      }
      if (p_tx_data_8_bits == NULL)
      {
        LL_USART_TransmitData9(p_usartx, (*p_tx_data_16_bits & uh_mask));
        p_tx_data_16_bits++;
      }
      else
      {
        LL_USART_TransmitData8(p_usartx, (*p_tx_data_8_bits & (uint8_t)(uh_mask & 0xFFU)));
        p_tx_data_8_bits++;
      }

      husart->tx_xfer_count--;
    }

    if (husart->rx_xfer_count > 0U)
    {
      /* Wait for RXNE Flag */
      if (USART_WaitOnFlagUntilTimeout(husart, LL_USART_ISR_RXNE_RXFNE, 0U, tick_start, timeout_ms) != HAL_OK)
      {
        husart->global_state = HAL_USART_STATE_IDLE;
        return HAL_TIMEOUT;
      }

      if (p_rx_data_8_bits == NULL)
      {
        *p_rx_data_16_bits = LL_USART_ReceiveData9(p_usartx) & uh_mask;
        p_rx_data_16_bits++;
      }
      else
      {
        *p_rx_data_8_bits = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_usartx) & uh_mask);
        p_rx_data_8_bits++;
      }

      husart->rx_xfer_count--;
    }
    rx_data_count = husart->rx_xfer_count;
  }

  /* At end of TxRx process, restore husart->global_state to Idle */
  husart->global_state = HAL_USART_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Send an amount of data in interrupt mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to data buffer.
  * @param  size_byte         Amount of bytes to be sent.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_Transmit_IT(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

