MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_TransmitReceive_IT(husart, (const uint8_t *)p_tx_data, (uint8_t *)p_rx_data, size_byte,
                                        HAL_USART_OPT_TXRX_IT_NONE);
}

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief  Full-duplex send and receive an amount of data in interrupt mode, allow user to enable Optional
  *         Interrupts part of \ref USART_TransmitReceive_IT_Optional_Interrupts.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_tx_data         Pointer to TX data buffer.
  * @param  p_rx_data         Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be sent (same amount to be received).
  * @param  interrupts        Optional interrupts part of \ref USART_TransmitReceive_IT_Optional_Interrupts.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data and the received data are handled as sets of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_TransmitReceive_IT_Opt(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                              uint32_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(IS_USART_OPT_TXRX_IT(interrupts));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_TransmitReceive_IT(husart, (const uint8_t *)p_tx_data, (uint8_t *)p_rx_data, size_byte,
                                        interrupts);
}
#endif /* USE_HAL_USART_FIFO */
#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
/**
  * @brief Send an amount of data in DMA mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to data buffer.
  * @param  size_byte         Amount of bytes.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_Transmit_DMA(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_tx != NULL);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_Transmit_DMA(husart, (const uint8_t *)p_data, size_byte, HAL_USART_OPT_DMA_TX_IT_HT);
}

/**
  * @brief  Send an amount of data in DMA mode, allow user to enable Optional Interrupts part of
  *         \ref USART_Transmit_DMA_Optional_Interrupts.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to data buffer.
  * @param  size_byte         Amount of bytes.
  * @param  interrupts        Optional interrupts part of \ref USART_Transmit_DMA_Optional_Interrupts.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_Transmit_DMA_Opt(hal_usart_handle_t *husart, const void *p_data, uint32_t size_byte,
                                        uint32_t interrupts)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_tx != NULL);
  ASSERT_DBG_PARAM(IS_USART_OPT_TX_DMA(interrupts));
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_USART_DMA_TX_VALID_SILENT_MODE(husart->hdma_tx, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_Transmit_DMA(husart, (const uint8_t *)p_data, size_byte, interrupts);
}

/**
  * @brief  Receive an amount of data in DMA mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be received.
  * @warning When the USART parity is enabled (PCE bit in register USART_CR1 = 1), the received data contains
  *         the parity bit (MSB position).
  * @warning If USART is configured in Master mode, the USART DMA transmit channel must be configured in order to
  *         generate the clock for the slave.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling or missing Tx DMA handle when acting as master.
  */
hal_status_t HAL_USART_Receive_DMA(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_rx != NULL);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_Receive_DMA(husart, (uint8_t *)p_data, size_byte, HAL_USART_OPT_DMA_RX_IT_HT);
}

/**
  * @brief  Receive an amount of data in DMA mode, allow user to enable Optional Interrupts part of
  *         \ref USART_Receive_DMA_Optional_Interrupts.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data            Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be received.
  * @param  interrupts        Optional interrupts part of \ref USART_Receive_DMA_Optional_Interrupts.
  * @warning When the USART parity is enabled (PCE bit in register USART_CR1 = 1), the received data contains
  *         the parity bit (MSB position).
  * @warning If USART is configured in Master mode, the USART DMA transmit channel must be configured in order to
  *         generate the clock for the slave.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling or missing Tx DMA handle when acting as master.
  */
hal_status_t HAL_USART_Receive_DMA_Opt(hal_usart_handle_t *husart, void *p_data, uint32_t size_byte,
                                       uint32_t interrupts)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_rx != NULL);
  ASSERT_DBG_PARAM(IS_USART_OPT_RX_DMA(interrupts));
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_USART_DMA_RX_VALID_SILENT_MODE(husart->hdma_rx, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

