MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_Receive_DMA(husart, (uint8_t *)p_data, size_byte, interrupts);
}

/**
  * @brief  Full-duplex transmit and receive an amount of data in non-blocking mode.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_tx_data         Pointer to TX data buffer.
  * @param  p_rx_data         Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be sent (same amount to be received).
  * @warning When the USART parity is enabled (PCE bit in register USART_CR1 = 1) the data received contains the
  *          parity bit.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data and the received data are handled as sets of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_TransmitReceive_DMA(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                           uint32_t size_byte)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_rx != NULL);
  ASSERT_DBG_PARAM(husart->hdma_tx != NULL);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_TransmitReceive_DMA(husart, (const uint8_t *)p_tx_data, (uint8_t *)p_rx_data, size_byte,
                                         (HAL_USART_OPT_DMA_TXRX_TX_IT_HT | HAL_USART_OPT_DMA_TXRX_RX_IT_HT));

}

/**
  * @brief  Full-duplex transmit and receive an amount of data in non-blocking mode, allow user to enable Optional
  *         Interrupts part of \ref USART_TransmitReceive_DMA_Optional_Interrupts.
  * @param  husart            Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_tx_data         Pointer to TX data buffer.
  * @param  p_rx_data         Pointer to RX data buffer.
  * @param  size_byte         Amount of bytes to be sent (same amount to be received).
  * @param  interrupts        Optional interrupts part of \ref USART_TransmitReceive_DMA_Optional_Interrupts.
  * @warning When the USART parity is enabled (PCE bit in register USART_CR1 = 1) the data received contains the
  *          parity bit.
  * @warning When USART parity is not enabled (PCE bit in register USART_CR1 = 0), and Word Length is configured
  *         to 9 bits (M1-M0 = 01), the sent data and the received data are handled as sets of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_USART_TransmitReceive_DMA_Opt(hal_usart_handle_t *husart, const void *p_tx_data, void *p_rx_data,
                                               uint32_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(husart->hdma_rx != NULL);
  ASSERT_DBG_PARAM(husart->hdma_tx != NULL);
  ASSERT_DBG_PARAM(IS_USART_OPT_TXRX_DMA(interrupts));
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_USART_DMA_TXRX_VALID_SILENT_MODE(husart->hdma_tx, husart->hdma_rx, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(husart, global_state, HAL_USART_STATE_IDLE, HAL_USART_STATE_TX_RX_ACTIVE);

  if (USART_CheckCommunicationReady(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  return USART_Start_TransmitReceive_DMA(husart, (const uint8_t *)p_tx_data, (uint8_t *)p_rx_data, size_byte,
                                         interrupts);
}

/**
  * @brief  Pause ongoing DMA transfers (Tx, Rx or both).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_USART_Pause_DMA(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_RX_ACTIVE | HAL_USART_STATE_TX_ACTIVE |
                   HAL_USART_STATE_TX_RX_ACTIVE);

  p_usartx = USART_GET_INSTANCE(husart);
  const hal_usart_state_t temp_state = husart->global_state;
  if ((temp_state == HAL_USART_STATE_TX_ACTIVE) || (temp_state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    if (LL_USART_IsEnabledDMAReq_TX(p_usartx) != 0U)
    {
      LL_USART_DisableDMAReq_TX(p_usartx);
    }
  }

  if ((temp_state == HAL_USART_STATE_RX_ACTIVE) || (temp_state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    if (LL_USART_IsEnabledDMAReq_RX(p_usartx) != 0U)
    {
      LL_USART_DisableIT_PE(p_usartx);
      LL_USART_DisableIT_ERROR(p_usartx);
      LL_USART_DisableDMAReq_RX(p_usartx);
    }
  }
  return HAL_OK;
}

/**
  * @brief Resume ongoing DMA transfers (Tx, Rx or both).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_USART_Resume_DMA(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;
  hal_usart_state_t state;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_RX_ACTIVE | HAL_USART_STATE_TX_ACTIVE |
                   HAL_USART_STATE_TX_RX_ACTIVE);

  p_usartx = USART_GET_INSTANCE(husart);
  state = husart->global_state;
  if ((state == HAL_USART_STATE_TX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    if (husart->hdma_tx != NULL)
    {
      LL_USART_EnableDMAReq_TX(p_usartx);
    }
  }

  if ((state == HAL_USART_STATE_RX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    if (husart->hdma_rx != NULL)
    {
      LL_USART_ClearFlag_ORE(p_usartx);

      if (LL_USART_GetParity(p_usartx) != LL_USART_PARITY_NONE)
      {
        LL_USART_EnableIT_PE(p_usartx);
      }
      LL_USART_RequestRxDataFlush(p_usartx);
      LL_USART_EnableIT_ERROR(p_usartx);
      LL_USART_EnableDMAReq_RX(p_usartx);
    }
  }
  return HAL_OK;
}

#endif /* USE_HAL_USART_DMA */

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  * @warning This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_USART_Abort(hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE | HAL_USART_STATE_TX_ACTIVE
                   | HAL_USART_STATE_TX_RX_ACTIVE);

  if (husart->global_state != HAL_USART_STATE_IDLE)
  {
    husart->global_state = HAL_USART_STATE_ABORT;
    USART_Abort(husart);

    husart->global_state  = HAL_USART_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (Interrupt mode).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note    This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  * @warning This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_USART_Abort_IT(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;
  uint32_t abort_cplt = 1U;

  ASSERT_DBG_PARAM(husart != NULL);

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE | HAL_USART_STATE_TX_ACTIVE
                   | HAL_USART_STATE_TX_RX_ACTIVE);

  p_usartx = USART_GET_INSTANCE(husart);

  husart->global_state = HAL_USART_STATE_ABORT;

