MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  LL_USART_DisableIT_CR1(p_usartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_TXEIE_TXFNFIE |
                                    LL_USART_CR1_TCIE));
  LL_USART_DisableIT_CR3(p_usartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE | LL_USART_CR3_TXFTIE));

  if (husart->global_state != HAL_USART_STATE_IDLE)
  {
    husart->global_state = HAL_USART_STATE_ABORT;

    /* if Rx FIFO full or Tx FIFO empty Optional IT have been activated, clear status */
    if (LL_USART_IsEnabledIT_TXFE(p_usartx) != 0U)
    {
      LL_USART_DisableIT_TXFE(p_usartx);
      LL_USART_ClearFlag_TXFE(p_usartx);
    }
    if (LL_USART_IsEnabledIT_RXFF(p_usartx) != 0U)
    {
      LL_USART_DisableIT_RXFF(p_usartx);
    }
#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
    if (LL_USART_IsEnabledDMAReq_TX(p_usartx) != 0U)
    {
      LL_USART_DisableDMAReq_TX(p_usartx);
      if (husart->hdma_tx != NULL)
      {
        if (husart->hdma_tx->global_state == HAL_DMA_STATE_ACTIVE)
        {
          husart->hdma_tx->p_xfer_abort_cb = USART_DMATxAbortCallback;
          if (HAL_DMA_Abort_IT(husart->hdma_tx) == HAL_OK)
          {
            abort_cplt = 0U;
          }
        }
      }
    }

    if (LL_USART_IsEnabledDMAReq_RX(p_usartx) != 0U)
    {
      LL_USART_DisableDMAReq_RX(p_usartx);
      if (husart->hdma_rx != NULL)
      {
        if (husart->hdma_rx->global_state == HAL_DMA_STATE_ACTIVE)
        {
          husart->hdma_rx->p_xfer_abort_cb = USART_DMARxAbortCallback;
          if (HAL_DMA_Abort_IT(husart->hdma_rx) == HAL_OK)
          {
            abort_cplt = 0U;
          }
        }
      }
    }

#endif /* USE_HAL_USART_DMA */

    /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
    if (abort_cplt != 0U)
    {
      /* Reset Tx and Rx transfer counters */
      husart->rx_xfer_count = 0U;
      husart->tx_xfer_count = 0U;

      husart->p_rx_isr = NULL;
      husart->p_tx_isr = NULL;

      /* Clear the Error flags in the ICR register */
      LL_USART_ClearFlag(p_usartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
      /* Flush the whole TX FIFO (if needed) */
      if (husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED)
      {
        LL_USART_RequestTxDataFlush(p_usartx);
      }
#endif /* USE_HAL_USART_FIFO */

      LL_USART_RequestRxDataFlush(p_usartx);

      /* As no DMA to be aborted, call directly user Abort complete callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Abort Complete Callback */
      husart->p_abort_cplt_callback(husart);
#else
      /* Call legacy weak Abort Complete Callback */
      HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Even if Abort has done nothing as no transfer callback is called */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort Complete Callback */
    husart->p_abort_cplt_callback(husart);
#else
    /* Call legacy weak Abort Complete Callback */
    HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
  }
  husart->global_state  = HAL_USART_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief Send Specific USART Request.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param request Request to process.
  * @retval HAL_OK The request has been sent.
  */
hal_status_t HAL_USART_SendRequest(hal_usart_handle_t *husart, hal_usart_request_t request)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM(husart != NULL);
  ASSERT_DBG_PARAM(IS_USART_REQUEST_PARAMETER(request));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_IDLE);

  p_usartx = USART_GET_INSTANCE(husart);

  LL_USART_SetRequest(p_usartx, (uint16_t)request);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group12
  * @{
  This subsection provides the function handling the interruption of the USARTx in synchronous mode.

  - HAL_USART_IRQHandler(): process the interruption of an instance

  HAL_USART_IRQHandler() is designed to process the different interruptions in the following order:
    - Error on Rx side (PE, ORE, RTOF, UDR)
    - Error on DMA side
    - Data on Rx side
    - Data on Tx side

Depending on the process function one's use, different callback might be triggered:

| Process API \n \ \n Callbacks  | HAL_USART_Transmit_IT | HAL_USART_Receive_IT | HAL_USART_TransmitReceive_IT |
|--------------------------------|:---------------------:|:--------------------:|:----------------------------:|
| HAL_USART_TxCpltCallback       |           x           |                      |                              |
| HAL_USART_RxCpltCallback       |                       |          x           |                              |
| HAL_USART_ErrorCallback        |           x           |          x           |               x              |
| HAL_USART_TxRxCpltCallback     |                       |                      |               x              |

| Process API \n \ \n Callbacks   | HAL_USART_Transmit_IT_Opt       | HAL_USART_Receive_IT_Opt   |
|---------------------------------|:-------------------------------:|:--------------------------:|
| HAL_USART_TxCpltCallback        |                x                |                            |
| HAL_USART_RxCpltCallback        |                                 |               x            |
| HAL_USART_ErrorCallback         |                x                |               x            |
| HAL_USART_TxFifoEmptyCallback*  |                x                |                            |
| HAL_USART_RxFifoFullCallback**  |                                 |               x            |
@note * with HAL_USART_OPT_TX_IT_FIFO_EMPTY arguments value for interrupts parameter
@note ** with HAL_USART_OPT_RX_IT_FIFO_FULL arguments value for interrupts parameter

