MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
| Process API \n \ \n Callbacks  | HAL_USART_TransmitReceive_IT_Opt    |
|--------------------------------|:-----------------------------------:|
| HAL_USART_TxRxCpltCallback     |                   x                 |
| HAL_USART_ErrorCallback        |                   x                 |
| HAL_USART_TxFifoEmptyCallback* |                   x                 |
| HAL_USART_RxFifoFullCallback** |                   x                 |
@note * with HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY argument value for interrupts parameter
@note ** with HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL argument value for interrupts parameter

| Process API \n \ \n Callbacks   | HAL_USART_Transmit_DMA | HAL_USART_Receive_DMA | HAL_USART_TransmitReceive_DMA |
|---------------------------------|:----------------------:|:---------------------:|:-----------------------------:|
| HAL_USART_TxHalfCpltCallback*   |           x            |                       |               x               |
| HAL_USART_TxCpltCallback        |           x            |                       |                               |
| HAL_USART_RxHalfCpltCallback*   |                        |           x           |               x               |
| HAL_USART_RxCpltCallback        |                        |           x           |                               |
| HAL_USART_ErrorCallback**       |           x            |           x           |               x               |
| HAL_USART_TxRxCpltCallback      |                        |                       |               x               |
@note * these callbacks might be called following DMA IRQ management, not USARTx IRQ management.
@note ** these callbacks might be called following DMA IRQ management, or USARTx IRQ management.

| Process API \n \ \n Callbacks    | HAL_USART_Transmit_DMA_Opt()    | HAL_USART_Receive_DMA_Opt()    |
|----------------------------------|:-------------------------------:|:------------------------------:|
| HAL_USART_TxCpltCallback         |                x                |                                |
| HAL_USART_RxCpltCallback         |                                 |               x                |
| HAL_USART_ErrorCallback          |                x                |               x                |
| HAL_USART_TxFifoEmptyCallback*   |                x                |                                |
| HAL_USART_RxFifoFullCallback**   |                                 |               x                |
| HAL_USART_TxHalfCpltCallback***  |                x                |                                |
| HAL_USART_RxHalfCpltCallback**** |                                 |               x                |
@note * with HAL_USART_OPT_TX_IT_FIFO_EMPTY arguments value for interrupts parameter
@note ** with HAL_USART_OPT_RX_IT_FIFO_FULL arguments value for interrupts parameter
@note *** with HAL_USART_OPT_DMA_TX_IT_HT arguments value for interrupts parameter
@note **** with HAL_USART_OPT_DMA_RX_IT_HT arguments value for interrupts parameter

| Process API \n \ \n Callbacks    | HAL_USART_TransmitReceive_DMA_Opt() |
|----------------------------------|:-----------------------------------:|
| HAL_USART_TxRxCpltCallback       |                   x                 |
| HAL_USART_ErrorCallback          |                   x                 |
| HAL_USART_TxFifoEmptyCallback*   |                   x                 |
| HAL_USART_RxFifoFullCallback**   |                   x                 |
| HAL_USART_TxHalfCpltCallback***  |                   x                 |
| HAL_USART_RxHalfCpltCallback**** |                   x                 |
@note * with HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY arguments value for interrupts parameter
@note ** with HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL arguments value for interrupts parameter
@note *** with HAL_USART_OPT_DMA_TXRX_TX_IT_HT arguments value for interrupts parameter
@note **** with HAL_USART_OPT_DMA_TXRX_RX_IT_HT arguments value for interrupts parameter

| Process API \n \ \n Callbacks       | HAL_USART_Abort_IT |
|-------------------------------------|:------------------:|
| HAL_USART_AbortCpltCallback         |          x         |
  */

/**
  * @brief  Handle USART interrupt request.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
void HAL_USART_IRQHandler(hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);

  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  uint32_t isr_flags = LL_USART_READ_REG(p_usartx, ISR);
  uint32_t cr1_its   = LL_USART_READ_REG(p_usartx, CR1);
  uint32_t cr3_its   = LL_USART_READ_REG(p_usartx, CR3);

  uint32_t error_flags;
  uint32_t error_code = 0U;

  /* If no error occurs */
  error_flags = (isr_flags & (uint32_t)(LL_USART_ISR_PE | LL_USART_ISR_FE | LL_USART_ISR_ORE | LL_USART_ISR_NE |
                                        LL_USART_ISR_RTOF | LL_USART_ISR_UDR));
  if (error_flags == 0U)
  {
    /* USART in mode Receiver ---------------------------------------------------*/
    if (((isr_flags & LL_USART_ISR_RXNE_RXFNE) != 0U)
        && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3_its & LL_USART_CR3_RXFTIE) != 0U)))
    {
      if (husart->p_rx_isr != NULL)
      {
        husart->p_rx_isr(husart);
      }
      return;
    }
  }

  /* If some errors occur */
  if ((error_flags != 0U)
      && (((cr3_its & (LL_USART_CR3_RXFTIE | LL_USART_CR3_EIE)) != 0U)
          || ((cr1_its & (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE)) != 0U)))
  {
    /* USART parity error interrupt occurred -------------------------------------*/
    if (((isr_flags & LL_USART_ISR_PE) != 0U) && ((cr1_its & LL_USART_CR1_PEIE) != 0U))
    {
      LL_USART_ClearFlag_PE(p_usartx);

      error_code |= HAL_USART_RECEIVE_ERROR_PE;
    }

    /* USART frame error interrupt occurred --------------------------------------*/
    if (((isr_flags & LL_USART_ISR_FE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag_FE(p_usartx);

      error_code |= HAL_USART_RECEIVE_ERROR_FE;
    }

    /* USART noise error interrupt occurred --------------------------------------*/
    if (((isr_flags & LL_USART_ISR_NE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag_NE(p_usartx);

      error_code |= HAL_USART_RECEIVE_ERROR_NE;
    }

