MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
    /* USART Over-Run interrupt occurred -----------------------------------------*/
    if (((isr_flags & LL_USART_ISR_ORE) != 0U)
        && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3_its & (LL_USART_CR3_RXFTIE | LL_USART_CR3_EIE)) != 0U)))
    {
      LL_USART_ClearFlag_ORE(p_usartx);

      error_code |= HAL_USART_RECEIVE_ERROR_ORE;
    }

    /* USART Receiver Timeout interrupt occurred ---------------------------------*/
    if (((isr_flags & LL_USART_ISR_RTOF) != 0U) && ((cr1_its & LL_USART_CR1_RTOIE) != 0U))
    {
      LL_USART_ClearFlag_RTO(p_usartx);

      error_code |= HAL_USART_RECEIVE_ERROR_RTO;
    }

    /* USART SPI slave underrun error interrupt occurred -------------------------*/
    if (((isr_flags & LL_USART_ISR_UDR) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
    {
      /* Ignore SPI slave underrun errors when reception is going on */
      if (husart->global_state == HAL_USART_STATE_RX_ACTIVE)
      {
        LL_USART_ClearFlag_UDR(p_usartx);
        return;
      }
      else
      {
        LL_USART_ClearFlag_UDR(p_usartx);
        error_code |= HAL_USART_TRANSMIT_ERROR_UDR;
      }
    }

    /* Call USART Error callback function if need be --------------------------*/
    if (error_code != 0U)
    {
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
      /* update error codes */
      husart->last_error_codes = error_code;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
      /* USART in mode Receiver ---------------------------------------------------*/
      if (((isr_flags & LL_USART_ISR_RXNE_RXFNE) != 0U)
          && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
              || ((cr3_its & LL_USART_CR3_RXFTIE) != 0U)))
      {
        if (husart->p_rx_isr != NULL)
        {
          husart->p_rx_isr(husart);
        }
      }

#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
      /* If Overrun error occurs, or if any error occurs in DMA mode reception, consider error as blocking */
      if ((LL_USART_IsEnabledDMAReq_RX(p_usartx) != 0U)
          || ((uint32_t)(error_code & HAL_USART_RECEIVE_ERROR_ORE) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the USART state ready to be able to start again the process,
           Disable Interrupts, and disable DMA requests, if ongoing */
        USART_EndTransfer(husart);

        /* Abort the USART DMA Rx channel if enabled */
        if (LL_USART_IsEnabledDMAReq_RX(p_usartx) != 0U)
        {
          /* Disable the USART DMA Rx request if enabled */
          LL_USART_DisableDMAReq_RX(p_usartx);

          /* Abort the USART DMA Tx channel */
          if (husart->hdma_tx != NULL)
          {
            /* Set the USART Tx DMA Abort callback to NULL : no callback executed at end of DMA abort procedure */
            husart->hdma_tx->p_xfer_abort_cb = USART_DMADummy;

            (void)HAL_DMA_Abort_IT(husart->hdma_tx);
          }

          /* Abort the USART DMA Rx channel */
          if (husart->hdma_rx != NULL)
          {
            /* Set the USART Rx DMA Abort callback :
               It leads to call HAL_USART_ErrorCallback() at end of DMA abort procedure */
            husart->hdma_rx->p_xfer_abort_cb = USART_DMAAbortOnError;

            if (HAL_DMA_Abort_IT(husart->hdma_rx) != HAL_OK)
            {
              /* Call directly husart->hdma_rx->p_xfer_abort_cb function in case of error */
              husart->hdma_rx->p_xfer_abort_cb(husart->hdma_rx);
            }
          }
          else
          {
            /* Call user error callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Error Callback */
            husart->p_error_callback(husart);
#else
            /* Call legacy weak Error Callback */
            HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
          }
        }
        else
        {
          /* Call user error callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
          /* Call registered Error Callback */
          husart->p_error_callback(husart);
#else
          /* Call legacy weak Error Callback */
          HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
      }
      else
#endif /* USE_HAL_USART_DMA */
      {
        /* Non Blocking error : transfer could go on. Error is notified to user through user error callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Error Callback */
        husart->p_error_callback(husart);
#else
        /* Call legacy weak Error Callback */
        HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
      }
    }
    return;

  } /* End if some error occurs */

  /* USART in mode Transmitter ------------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_TXE_TXFNF) != 0U)
      && (((cr1_its & LL_USART_CR1_TXEIE_TXFNFIE) != 0U)
          || ((cr3_its & LL_USART_CR3_TXFTIE) != 0U)))
  {
    if (husart->p_tx_isr != NULL)
    {
      husart->p_tx_isr(husart);
    }
    return;
  }

  /* USART in mode Transmitter (transmission end) -----------------------------*/
  if (((isr_flags & LL_USART_ISR_TC) != 0U) && ((cr1_its & LL_USART_CR1_TCIE) != 0U))
  {
    USART_EndTransmit_IT(husart);
    return;
  }

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  /* USART TX Fifo Empty occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_TXFE) != 0U) && ((cr1_its & LL_USART_CR1_TXFEIE) != 0U))
  {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Tx Fifo Empty Callback */
    husart->p_tx_fifo_empty_callback(husart);
#else
    /* Call legacy weak Tx Fifo Empty Callback */
    HAL_USART_TxFifoEmptyCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    return;
  }

