MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  /* USART RX Fifo Full occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_RXFF) != 0U) && ((cr1_its & LL_USART_CR1_RXFFIE) != 0U))
  {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Rx Fifo Full Callback */
    husart->p_rx_fifo_full_callback(husart);
#else
    /* Call legacy weak Rx Fifo Full Callback */
    HAL_USART_RxFifoFullCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    return;
  }
#endif /* USE_HAL_USART_FIFO */
}

/**
  * @}
  */
/** @addtogroup USART_Exported_Functions_Group13
  * @{
  This subsection provides the default weak callbacks of the USARTx instance.
  Refer to HAL_USART_IRQHandler() documentation to get the details of which callback is triggered for each process
  functions. One can refer to the "How to use the USART HAL module driver" section to find the association between
  callbacks, registration function and default callback values. Here is the table of the default weak callbacks:

  Callback name               | Default value
  ----------------------------| -----------------------------------
  TxHalfCpltCallback          | HAL_USART_TxHalfCpltCallback()
  TxCpltCallback              | HAL_USART_TxCpltCallback()
  RxHalfCpltCallback          | HAL_USART_RxHalfCpltCallback()
  RxCpltCallback              | HAL_USART_RxCpltCallback()
  ErrorCallback               | HAL_USART_ErrorCallback()
  AbortCpltCallback           | HAL_USART_AbortCpltCallback()
  TxRxCpltCallback            | HAL_USART_TxRxCpltCallback()
  RxFifoFullCallback          | HAL_USART_RxFifoFullCallback()
  TxFifoEmptyCallback         | HAL_USART_TxFifoEmptyCallback()

  */
/**
  * @brief Tx Transfer completed callback.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_TxCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_TxCpltCallback() can be implemented in the user file.
    */
}

/**
  * @brief  Tx Half Transfer completed callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_TxHalfCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_TxHalfCpltCallback() can be implemented in the user file.
    */
}

/**
  * @brief  Rx Transfer completed callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_RxCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_RxCpltCallback() can be implemented in the user file.
    */
}

/**
  * @brief  Rx Half Transfer completed callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_RxHalfCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_RxHalfCpltCallback() can be implemented in the user file
    */
}

/**
  * @brief Tx/Rx Transfers completed callback for the non-blocking process.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_TxRxCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_TxRxCpltCallback() can be implemented in the user file
    */
}

/**
  * @brief USART error callback.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_ErrorCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_ErrorCallback() can be implemented in the user file.
    */
}

/**
  * @brief  USART Abort Complete callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_AbortCpltCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_AbortCpltCallback() can be implemented in the user file.
    */
}
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief  USART RX Fifo full callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_RxFifoFullCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_RxFifoFullCallback() can be implemented in the user file.
    */
}

/**
  * @brief  USART TX Fifo empty callback.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
__WEAK void HAL_USART_TxFifoEmptyCallback(hal_usart_handle_t *husart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(husart);

  /** @warning This function must not be modified, when the callback is needed,
    *          the HAL_USART_TxFifoEmptyCallback() can be implemented in the user file.
    */
}
#endif /* USE_HAL_USART_FIFO */

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group9
  * @{
    A set of functions is provided to control the states and errors:
      - HAL_USART_GetState(): Return the USART handle state.
      - HAL_USART_GetClockFreq(): Return the peripheral clock frequency.
      - HAL_USART_GetLastErrorCodes(): Return the last error of the USART handle.
  */

/**
  * @brief  Return the USART handle state.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval hal_usart_state_t USART state
  */
hal_usart_state_t HAL_USART_GetState(const hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);

  return husart->global_state;
}

/**
  * @brief  Return the peripheral clock frequency.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval uint32_t Frequency in Hz.
  * @retval 0 source clock of the USART instance not configured or not ready
  */
uint32_t HAL_USART_GetClockFreq(const hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  ASSERT_DBG_PARAM((husart != NULL));

  ASSERT_DBG_STATE(husart->global_state, HAL_USART_STATE_INIT | HAL_USART_STATE_IDLE | HAL_USART_STATE_RX_ACTIVE
                   | HAL_USART_STATE_TX_ACTIVE | HAL_USART_STATE_TX_RX_ACTIVE | HAL_USART_STATE_ABORT);

  p_usartx = USART_GET_INSTANCE(husart);

  return HAL_RCC_USART_GetKernelClkFreq(p_usartx);
}
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)

/**
  * @brief  Return the USART last errors.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval Current Last Errors Codes
  */
uint32_t HAL_USART_GetLastErrorCodes(const hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);
  return husart->last_error_codes;
}
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup USART_Exported_Functions_Group10
  * @{
  This subsection provides functions to control the bus of the USARTx instance:
    - HAL_USART_AcquireBus(): Acquire the bus
    - HAL_USART_ReleaseBus(): Release the bus.

