MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  For multitask applications, use the bus operation functions to avoid race conditions.
  */
/**
  * @brief Acquire the current instance bus.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  timeout_ms Timeout in milliseconds for the acquire to expire.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_USART_AcquireBus(hal_usart_handle_t *husart, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((husart != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreTake(&husart->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the current instance bus.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_USART_ReleaseBus(hal_usart_handle_t *husart)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((husart != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreRelease(&husart->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /*USE_HAL_MUTEX */
#if defined (USE_HAL_USART_USER_DATA) && (USE_HAL_USART_USER_DATA == 1)

/** @addtogroup USART_Exported_Functions_Group11
  * @{
  This subsection provides functions to set user-specific data to a USARTx instance:
    - HAL_USART_SetUserData(): Set user data in the handler.
    - HAL_USART_GetUserData(): Get user data from the handler.
  */

/**
  * @brief Store user data pointer into the handle.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_USART_SetUserData(hal_usart_handle_t *husart, const void *p_user_data)
{
  ASSERT_DBG_PARAM(husart != NULL);

  husart->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve user data pointer from the handle.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval Pointer to the user data.
  */
const void *HAL_USART_GetUserData(const hal_usart_handle_t *husart)
{
  ASSERT_DBG_PARAM(husart != NULL);

  return (husart->p_user_data);
}

/**
  * @}
  */
#endif /* USE_HAL_USART_USER_DATA */

/**
  * @}
  */
/** @addtogroup USART_Private_Functions USART Private Functions
  * @{
  */

/**
  * @brief  Private function to abort ongoing transfers (blocking mode).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  * @warning This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  */
static void USART_Abort(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  LL_USART_DisableIT_CR1(p_usartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_TXEIE_TXFNFIE |
                                    LL_USART_CR1_TCIE | LL_USART_CR1_RXFFIE | LL_USART_CR1_TXFEIE));
  LL_USART_DisableIT_CR3(p_usartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE | LL_USART_CR3_TXFTIE));

#if defined (USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
  if (LL_USART_IsEnabledDMAReq_TX(p_usartx) != 0U)
  {
    LL_USART_DisableDMAReq_TX(p_usartx);
    /* Abort the USART DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (husart->hdma_tx != NULL)
    {
      (void)HAL_DMA_Abort(husart->hdma_tx);
    }
  }
  if (LL_USART_IsEnabledDMAReq_RX(p_usartx) != 0U)
  {
    LL_USART_DisableDMAReq_RX(p_usartx);
    /* Abort the USART DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (husart->hdma_rx != NULL)
    {
      (void)HAL_DMA_Abort(husart->hdma_rx);
    }
  }
#endif /* USE_HAL_USART_DMA */

  husart->rx_xfer_count = 0U;
  husart->tx_xfer_count = 0U;

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_usartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if (husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED)
  {
    LL_USART_RequestTxDataFlush(p_usartx);
  }
#endif /* USE_HAL_USART_FIFO */

  LL_USART_RequestRxDataFlush(p_usartx);

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  husart->last_error_codes = HAL_USART_ERROR_NONE;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */

}

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Initialize the callbacks to their default values.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
static void USART_InitCallbacksToDefault(hal_usart_handle_t *husart)
{
  /* Init the USART Callback settings */
  husart->p_tx_half_cplt_callback       = HAL_USART_TxHalfCpltCallback;    /* Legacy weak TxHalfCpltCallback        */
  husart->p_tx_cplt_callback            = HAL_USART_TxCpltCallback;        /* Legacy weak TxCpltCallback            */
  husart->p_rx_half_cplt_callback       = HAL_USART_RxHalfCpltCallback;    /* Legacy weak RxHalfCpltCallback        */
  husart->p_rx_cplt_callback            = HAL_USART_RxCpltCallback;        /* Legacy weak RxCpltCallback            */
  husart->p_tx_rx_cplt_callback         = HAL_USART_TxRxCpltCallback;      /* Legacy weak TxRxCpltCallback          */
  husart->p_error_callback              = HAL_USART_ErrorCallback;         /* Legacy weak ErrorCallback             */
  husart->p_abort_cplt_callback         = HAL_USART_AbortCpltCallback;     /* Legacy weak AbortCpltCallback         */
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  husart->p_rx_fifo_full_callback       = HAL_USART_RxFifoFullCallback;    /* Legacy weak RxFifoFullCallback        */
  husart->p_tx_fifo_empty_callback      = HAL_USART_TxFifoEmptyCallback;   /* Legacy weak TxFifoEmptyCallback       */
#endif /* USE_HAL_USART_FIFO */
}
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

