MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)
/**
  * @brief  End ongoing transfer on USART peripheral (following error detection or Transfer completion).
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
static void USART_EndTransfer(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
  /* Disable TXEIE, TCIE, RXNE, RXFT, TXFT, PE and ERR (Frame error, noise error, overrun error) interrupts */
  LL_USART_DisableIT_CR1(p_usartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_TXEIE_TXFNFIE |
                                    LL_USART_CR1_TCIE));
  LL_USART_DisableIT_CR3(p_usartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE | LL_USART_CR3_TXFTIE));

  husart->p_rx_isr = NULL;
  husart->p_tx_isr = NULL;

  husart->global_state = HAL_USART_STATE_IDLE;
}

/**
  * @brief  DMA USART transmit process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMATransmitCplt(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    husart->tx_xfer_count = 0U;

    if (husart->global_state == HAL_USART_STATE_TX_ACTIVE)
    {
      /* Disable the DMA transfer for transmit request by resetting the DMAT bit
         in the USART CR3 register */
      LL_USART_DisableDMAReq_TX(p_usartx);

      LL_USART_EnableIT_TC(p_usartx);
    }
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* DMA Circular mode */
  else
  {
    if (husart->global_state == HAL_USART_STATE_TX_ACTIVE)
    {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Complete Callback */
      husart->p_tx_cplt_callback(husart);
#else
      /* Call legacy weak Tx Complete Callback */
      HAL_USART_TxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
}

/**
  * @brief  DMA USART transmit process half complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMATxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Tx Half Complete Callback */
  husart->p_tx_half_cplt_callback(husart);
#else
  /* Call legacy weak Tx Half Complete Callback */
  HAL_USART_TxHalfCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART receive process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMAReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    husart->rx_xfer_count = 0U;

    LL_USART_DisableIT_PE(p_usartx);
    LL_USART_DisableIT_ERROR(p_usartx);

    /* Disable the DMA RX transfer for the receiver request by resetting the DMAR bit
       in USART CR3 register */
    LL_USART_DisableDMAReq_RX(p_usartx);
    /* similarly, disable the DMA TX transfer that was started to provide the
       clock to the slave device */
    LL_USART_DisableDMAReq_TX(p_usartx);

    if (husart->global_state == HAL_USART_STATE_RX_ACTIVE)
    {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Rx Complete Callback */
      husart->p_rx_cplt_callback(husart);
#else
      /* Call legacy weak Rx Complete Callback */
      HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
    /* The USART state is HAL_USART_STATE_BUSY_TX_RX */
    else
    {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Rx Complete Callback */
      husart->p_tx_rx_cplt_callback(husart);
#else
      /* Call legacy weak Tx Rx Complete Callback */
      HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
    husart->global_state = HAL_USART_STATE_IDLE;
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* DMA circular mode */
  else
  {
    if (husart->global_state == HAL_USART_STATE_RX_ACTIVE)
    {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Rx Complete Callback */
      husart->p_rx_cplt_callback(husart);
#else
      /* Call legacy weak Rx Complete Callback */
      HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
    /* The USART state is HAL_USART_STATE_BUSY_TX_RX */
    else
    {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Rx Complete Callback */
      husart->p_tx_rx_cplt_callback(husart);
#else
      /* Call legacy weak Tx Rx Complete Callback */
      HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
    }
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
}

/**
  * @brief  DMA USART receive process half complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMARxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Rx Half Complete Callback */
  husart->p_rx_half_cplt_callback(husart);
#else
  /* Call legacy weak Rx Half Complete Callback */
  HAL_USART_RxHalfCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART communication error callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMAError(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  husart->rx_xfer_count = 0U;
  husart->tx_xfer_count = 0U;

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  const hal_usart_state_t temp_state = husart->global_state;

  if ((temp_state == HAL_USART_STATE_RX_ACTIVE) || (temp_state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    husart->last_error_codes |= HAL_USART_RECEIVE_ERROR_DMA;
  }
  if ((temp_state == HAL_USART_STATE_TX_ACTIVE) || (temp_state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    husart->last_error_codes |= HAL_USART_TRANSMIT_ERROR_DMA;
  }
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
  USART_EndTransfer(husart);
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Error Callback */
  husart->p_error_callback(husart);
#else
  /* Call legacy weak Error Callback */
  HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART communication abort callback, when initiated by HAL services on Error
  *         (To be called at end of DMA Abort procedure following error occurrence).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMAAbortOnError(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  husart->rx_xfer_count = 0U;
  husart->tx_xfer_count = 0U;

