MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Error Callback */
  husart->p_error_callback(husart);
#else
  /* Call legacy weak Error Callback */
  HAL_USART_ErrorCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART Tx communication abort callback, when initiated by user
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @warning When this callback is executed, User Abort complete callback is called only if no
  *          Abort still ongoing for Rx DMA Handle.
  */
static void USART_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  /* Check if an Abort process is still ongoing */
  if (husart->hdma_rx != NULL)
  {
    if ((husart->hdma_rx->global_state == HAL_DMA_STATE_ABORT) && (husart->hdma_rx->p_xfer_abort_cb != NULL))
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  husart->rx_xfer_count = 0U;
  husart->tx_xfer_count = 0U;

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  husart->last_error_codes = 0;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_usartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  husart->global_state = HAL_USART_STATE_IDLE;

  /* Call user Abort complete callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Complete Callback */
  husart->p_abort_cplt_callback(husart);
#else
  /* Call legacy weak Abort Complete Callback */
  HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @warning When this callback is executed, User Abort complete callback is called only if no
  *          Abort still ongoing for Tx DMA Handle.
  */
static void USART_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_usart_handle_t *husart = (hal_usart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  /* Check if an Abort process is still ongoing */
  if (husart->hdma_tx != NULL)
  {
    if ((husart->hdma_tx->global_state == HAL_DMA_STATE_ABORT) && (husart->hdma_tx->p_xfer_abort_cb != NULL))
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  husart->rx_xfer_count = 0U;
  husart->tx_xfer_count = 0U;

#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
  husart->last_error_codes = 0;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */

  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_usartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  husart->global_state = HAL_USART_STATE_IDLE;

  /* Call user Abort complete callback */
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Complete Callback */
  husart->p_abort_cplt_callback(husart);
#else
  /* Call legacy weak Abort Complete Callback */
  HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART Dummy callback to prevent a call to a null pointer on DMA side.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void USART_DMADummy(hal_dma_handle_t *hdma)
{
  STM32_UNUSED(hdma);
}

#endif /* USE_HAL_USART_DMA */
/**
  * @brief If not enabled, enables the USART instance and check acknowledge bits.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK USART Ready for processing.
  * @retval HAL_TIMEOUT USART took to long to acknowledge.
  */
hal_status_t USART_CheckEnabledState(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
  hal_status_t tmp_status = HAL_OK;
  /* Check if Instance is enabled */
  /* - If Instance is already enabled : nothing to do */
  /* - If not, enable instance and check TEACK and REACK bits if needed */
  if (LL_USART_IsEnabled(p_usartx) == 0U)
  {
    LL_USART_Enable(p_usartx);
    tmp_status = USART_CheckCommunicationReady(husart);
  }
  return tmp_status;
}

/**
  * @brief  Check acknowledge bits.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @retval HAL_OK USART Ready for processing.
  * @retval HAL_TIMEOUT USART took to long to acknowledge.
  */
hal_status_t USART_CheckCommunicationReady(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
  uint32_t count;
  /* Init tickstart for timeout management */
  /* Check if the Transmitter is enabled */
  if (LL_USART_IsEnabledDirectionTx(p_usartx) != 0U)
  {
    /** 8 is the number of required instructions cycles for the below loop statement.
      * The USART_ENABLE_TIMEOUT_MS is expressed in ms.
      */
    count = USART_ENABLE_TIMEOUT_MS * (SystemCoreClock / 8U / 1000U);
    do
    {
      count--;
      if (count == 0U)
      {
        /* Timeout occurred */
        return HAL_TIMEOUT;
      }
      /* Wait until TEACK flag is set */
    } while (LL_USART_IsActiveFlag_TEACK(p_usartx) == 0U);
  }

  /* Check if the Receiver is enabled */
  if (LL_USART_IsEnabledDirectionRx(p_usartx) != 0U)
  {
    /** 8 is the number of required instructions cycles for the below loop statement.
      * The USART_ENABLE_TIMEOUT_MS is expressed in ms.
      */
    count = USART_ENABLE_TIMEOUT_MS * (SystemCoreClock / 8U / 1000U);
    do
    {
      count--;
      if (count == 0U)
      {
        /* Timeout occurred */
        return HAL_TIMEOUT;
      }
      /* Wait until TEACK flag is set */
    } while (LL_USART_IsActiveFlag_REACK(p_usartx) == 0U);
  }
  return HAL_OK;
}

/**
  * @brief  Handle USART Communication Timeout. It waits
  *         until a flag is no longer in the specified status.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  flag Specifies the USART flag to check.
  * @param  status the actual Flag status (1U or 0U).
  * @param  tick_start Tick start value
  * @param  timeout_ms timeout duration.
  * @retval HAL status
  */
static hal_status_t USART_WaitOnFlagUntilTimeout(hal_usart_handle_t *husart, uint32_t flag, uint32_t status,
                                                 uint32_t tick_start, uint32_t timeout_ms)
{
  const USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  /* Wait until flag is set */
  while (((LL_USART_READ_REG(p_usartx, ISR) & flag) == status))
  {
    /* Check for the Timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if ((LL_USART_IsActiveFlag(p_usartx, flag) == status))
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Interrupt service routine for sending 8bit data.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note    Function called under interruption only, once
  *          interruptions have been enabled by HAL_USART_Transmit_IT() or HAL_USART_TransmitReceive_IT().
  * @note ISR function executed when FIFO mode is disabled and when the
  *          data word length is less than 9 bits long.
  * @warning The USART errors are not managed to avoid the overrun error.
  */
static void USART_TxISR_8BIT(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  if (husart->tx_xfer_count == 0U)
  {
    LL_USART_DisableIT_TXE_TXFNF(p_usartx);

    LL_USART_EnableIT_TC(p_usartx);
  }
  else
  {
    LL_USART_TransmitData8(p_usartx, *husart->p_tx_buff);
    husart->p_tx_buff++;
    husart->tx_xfer_count--;
  }
}

/**
  * @brief  Interrupt service routine for sending 16bit data.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note    Function called under interruption only, once
  *          interruptions have been enabled by HAL_USART_Transmit_IT() or HAL_USART_TransmitReceive_IT().
  * @warning The USART errors are not managed to avoid the overrun error.
  * @note ISR function executed when FIFO mode is disabled and when the
  *         data word length is 9 bits long.
  */
static void USART_TxISR_16BIT(hal_usart_handle_t *husart)
{
  const uint16_t *tmp;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  if (husart->tx_xfer_count == 0U)
  {
    LL_USART_DisableIT_TXE_TXFNF(p_usartx);

    LL_USART_EnableIT_TC(p_usartx);
  }
  else
  {
    tmp = (const uint16_t *) husart->p_tx_buff;
    LL_USART_TransmitData9(p_usartx, *tmp);
    husart->p_tx_buff += 2U;
    husart->tx_xfer_count--;
  }
}

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief  Interrupt service routine for sending 8bit data using FIFO.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note    Function called under interruption only, once
  *          interruptions have been enabled by HAL_USART_Transmit_IT() or HAL_USART_TransmitReceive_IT().
  * @warning The USART errors are not managed to avoid the overrun error.
  * @note ISR function executed when FIFO mode is enabled and when the
  *          data word length is less than 9 bits long.
  */
static void USART_TxISR_8BIT_FIFOEN(hal_usart_handle_t *husart)
{
  uint16_t nb_tx_data;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  for (nb_tx_data = husart->nb_tx_data_to_process ; nb_tx_data > 0U ; nb_tx_data--)
  {
    if (husart->tx_xfer_count == 0U)
    {
      LL_USART_DisableIT_TXFT(p_usartx);

      LL_USART_EnableIT_TC(p_usartx);
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
      /* if Tx FIFO empty Optional IT has been activated, check if we can call the callback */
      if (LL_USART_IsEnabledIT_TXFE(p_usartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_TXFE(p_usartx) != 0U)
        {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
          /* Call registered Tx Fifo Empty Callback */
          husart->p_tx_fifo_empty_callback(husart);
#else
          /* Call legacy weak Tx Fifo Empty Callback */
          HAL_USART_TxFifoEmptyCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_TXFE(p_usartx);
        LL_USART_ClearFlag_TXFE(p_usartx);
      }
#endif /* USE_HAL_USART_FIFO */
      break;
    }
    else if (LL_USART_IsActiveFlag_TXE_TXFNF(p_usartx) != 0U)
    {
      LL_USART_TransmitData8(p_usartx, *husart->p_tx_buff);
      husart->p_tx_buff++;
      husart->tx_xfer_count--;
    }
    else
    {
      /* Nothing to do */
    }
  }
}

/**
  * @brief  Interrupt service routine for sending 16bit data using FIFO.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note    Function called under interruption only, once
  *          interruptions have been enabled by HAL_USART_Transmit_IT() or HAL_USART_TransmitReceive_IT().
  * @warning The USART errors are not managed to avoid the overrun error.
  * @note ISR function executed when FIFO mode is enabled and when the
  *         data word length is 9 bits long.
  */
static void USART_TxISR_16BIT_FIFOEN(hal_usart_handle_t *husart)
{
  const uint16_t *tmp;
  uint16_t  nb_tx_data;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  for (nb_tx_data = husart->nb_tx_data_to_process ; nb_tx_data > 0U ; nb_tx_data--)
  {
    if (husart->tx_xfer_count == 0U)
    {
      LL_USART_DisableIT_TXFT(p_usartx);

      LL_USART_EnableIT_TC(p_usartx);
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
      /* if Tx FIFO empty Optional IT has been activated, check if we can call the callback */
      if (LL_USART_IsEnabledIT_TXFE(p_usartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_TXFE(p_usartx) != 0U)
        {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
          /* Call registered Tx Fifo Empty Callback */
          husart->p_tx_fifo_empty_callback(husart);
#else
          /* Call legacy weak Tx Fifo Empty Callback */
          HAL_USART_TxFifoEmptyCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_TXFE(p_usartx);
        LL_USART_ClearFlag_TXFE(p_usartx);
      }
#endif /* USE_HAL_USART_FIFO */
      break;
    }
    else if (LL_USART_IsActiveFlag_TXE_TXFNF(p_usartx) != 0U)
    {
      tmp = (const uint16_t *) husart->p_tx_buff;
      LL_USART_TransmitData9(p_usartx, *tmp);
      husart->p_tx_buff += 2U;
      husart->tx_xfer_count--;
    }
    else
    {
      /* Nothing to do */
    }
  }
}
#endif /* USE_HAL_USART_FIFO */

/**
  * @brief  Interrupt service routine for receiving 8bit data.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Receive_IT() or HAL_USART_TransmitReceive_IT().
  * @note ISR function executed when FIFO mode is disabled and when the
  *          data word length is less than 9 bits long.
  */
static void USART_RxISR_8BIT(hal_usart_handle_t *husart)
{
  const hal_usart_state_t state = husart->global_state;
  uint32_t tx_data_count;
  uint32_t tx_ftie;
  uint16_t uh_mask = husart->rdr_register_mask;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  if ((state == HAL_USART_STATE_RX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    *husart->p_rx_buff = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_usartx) & uh_mask);
    husart->p_rx_buff++;
    husart->rx_xfer_count--;

    if (husart->rx_xfer_count == 0U)
    {
      /* Disable the USART Parity Error Interrupt and RXNE interrupt*/
      LL_USART_DisableIT_CR1(p_usartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE));

