MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
      /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
      LL_USART_DisableIT_ERROR(p_usartx);

      /* Clear RxISR function pointer */
      husart->p_rx_isr = NULL;

      tx_ftie = LL_USART_IsEnabledIT_TXFT(p_usartx);
      tx_data_count = husart->tx_xfer_count;

      if (state == HAL_USART_STATE_RX_ACTIVE)
      {
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
        /* Clear SPI slave underrun flag and discard transmit data */
        if (husart->usart_mode == HAL_USART_MODE_SLAVE)
        {
          LL_USART_ClearFlag_UDR(p_usartx);
          LL_USART_RequestTxDataFlush(p_usartx);
        }
#endif /* USE_HAL_USART_FIFO */

        /* Rx process is completed, restore husart->global_state to Idle */
        husart->global_state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Rx Complete Callback */
        husart->p_rx_cplt_callback(husart);
#else
        /* Call legacy weak Rx Complete Callback */
        HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
      }
      else if ((LL_USART_IsEnabledIT_TC(p_usartx) == 0U) && (tx_ftie == 0U) && (tx_data_count == 0U))
      {
        /* TxRx process is completed, restore husart->global_state to Idle */
        husart->global_state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Tx Rx Complete Callback */
        husart->p_tx_rx_cplt_callback(husart);
#else
        /* Call legacy weak Tx Rx Complete Callback */
        HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
      }
      else
      {
        /* Nothing to do */
      }
    }
    else if ((state == HAL_USART_STATE_RX_ACTIVE) && (husart->usart_mode == HAL_USART_MODE_MASTER))
    {
      /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
      LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
    }
    else
    {
      /* Nothing to do */
    }
  }
}

/**
  * @brief  Interrupt service routine for receiving 16bit data.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Receive_IT() or HAL_USART_TransmitReceive_IT().
  * @note ISR function executed when FIFO mode is disabled and when the
  *          data word length is 9 bits long.
  */
static void USART_RxISR_16BIT(hal_usart_handle_t *husart)
{
  const hal_usart_state_t state = husart->global_state;
  uint32_t tx_data_count;
  uint32_t tx_ftie;
  uint16_t *tmp;
  uint16_t uh_mask = husart->rdr_register_mask;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  if ((state == HAL_USART_STATE_RX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    tmp = (uint16_t *) husart->p_rx_buff;
    *tmp = (LL_USART_ReceiveData9(p_usartx) & uh_mask);
    husart->p_rx_buff += 2U;
    husart->rx_xfer_count--;

    if (husart->rx_xfer_count == 0U)
    {
      /* Disable the USART Parity Error Interrupt and RXNE interrupt*/
      LL_USART_DisableIT_CR1(p_usartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE));

      /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
      LL_USART_DisableIT_ERROR(p_usartx);

      /* Clear p_rx_isr function pointer */
      husart->p_rx_isr = NULL;

      tx_ftie = LL_USART_IsEnabledIT_TXFT(p_usartx);
      tx_data_count = husart->tx_xfer_count;

      if (state == HAL_USART_STATE_RX_ACTIVE)
      {
        /* Clear SPI slave underrun flag and discard transmit data */
        if (husart->usart_mode == HAL_USART_MODE_SLAVE)
        {
          LL_USART_ClearFlag_UDR(p_usartx);
          LL_USART_RequestTxDataFlush(p_usartx);
        }

        /* Rx process is completed, restore husart->global_state to Idle */
        husart->global_state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Rx Complete Callback */
        husart->p_rx_cplt_callback(husart);
#else
        /* Call legacy weak Rx Complete Callback */
        HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
      }
      else if ((LL_USART_IsEnabledIT_TC(p_usartx) == 0U) && (tx_ftie == 0U) && (tx_data_count == 0U))
      {
        /* TxRx process is completed, restore husart->global_state to Idle */
        husart->global_state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        /* Call registered Tx Rx Complete Callback */
        husart->p_tx_rx_cplt_callback(husart);
#else
        /* Call legacy weak Tx Rx Complete Callback */
        HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
      }
      else
      {
        /* Nothing to do */
      }
    }
    else if ((state == HAL_USART_STATE_RX_ACTIVE) && (husart->usart_mode == HAL_USART_MODE_MASTER))
    {
      /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
      LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
    }
    else
    {
      /* Nothing to do */
    }
  }
}

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
/**
  * @brief  Interrupt service routine for receiving 8bit data using FIFO.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Receive_IT() or HAL_USART_TransmitReceive_IT().
  * @note ISR function executed when FIFO mode is enabled and when the
  *          data word length is less than 9 bits long.
  */
static void USART_RxISR_8BIT_FIFOEN(hal_usart_handle_t *husart)
{
  hal_usart_state_t state = husart->global_state;
  uint32_t tx_data_count;
  uint32_t rx_data_count;
  uint32_t tx_ftie;
  uint16_t uh_mask = husart->rdr_register_mask;
  uint16_t nb_rx_data;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

