MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  /* Check that a Rx process is ongoing */
  if ((state == HAL_USART_STATE_RX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    rx_data_count = husart->rx_xfer_count;
    for (nb_rx_data = husart->nb_rx_data_to_process ; nb_rx_data > 0U ; nb_rx_data--)
    {
      if (LL_USART_IsActiveFlag_RXNE_RXFNE(p_usartx) != 0U)
      {
        *husart->p_rx_buff = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_usartx) & uh_mask);
        husart->p_rx_buff++;
        husart->rx_xfer_count--;

        if (husart->rx_xfer_count == 0U)
        {
          /* Disable the USART Parity Error Interrupt */
          LL_USART_DisableIT_PE(p_usartx);

          /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error)
             and RX FIFO Threshold interrupt */
          LL_USART_DisableIT_CR3(p_usartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE));

          /* Clear p_rx_isr function pointer */
          husart->p_rx_isr = NULL;

          tx_ftie = LL_USART_IsEnabledIT_TXFT(p_usartx);
          tx_data_count = husart->tx_xfer_count;

          if (state == HAL_USART_STATE_RX_ACTIVE)
          {
            /* Clear SPI slave underrun flag and discard transmit data */
            if (husart->usart_mode == HAL_USART_MODE_SLAVE)
            {
              LL_USART_ClearFlag_UDR(p_usartx);
              LL_USART_RequestTxDataFlush(p_usartx);
            }
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
            /* if Rx FIFO full Optional IT has been activated, check if we can call the callback */
            if (LL_USART_IsEnabledIT_RXFF(p_usartx) != 0U)
            {
              if (LL_USART_IsActiveFlag_RXFF(p_usartx) != 0U)
              {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
                /* Call registered Rx FIFO Full Callback */
                husart->p_rx_fifo_full_callback(husart);
#else
                /* Call legacy weak Rx FIFO Full Callback */
                HAL_USART_RxFifoFullCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
              }
            }
#endif /* USE_HAL_USART_FIFO */
            /* Rx process is completed, restore husart->global_state to Idle */
            husart->global_state = HAL_USART_STATE_IDLE;
            state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Rx Complete Callback */
            husart->p_rx_cplt_callback(husart);
#else
            /* Call legacy weak Rx Complete Callback */
            HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
          }
          else if ((LL_USART_IsEnabledIT_TC(p_usartx) == 0U) && (tx_ftie == 0U) && (tx_data_count == 0U))
          {
            /* TxRx process is completed, restore husart->global_state to Idle */
            husart->global_state = HAL_USART_STATE_IDLE;
            state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Rx Complete Callback */
            husart->p_tx_rx_cplt_callback(husart);
#else
            /* Call legacy weak Tx Rx Complete Callback */
            HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
          }
          else
          {
            /* Nothing to do */
          }
        }
        else if ((state == HAL_USART_STATE_RX_ACTIVE) && (husart->usart_mode == HAL_USART_MODE_MASTER))
        {
          /* As data to process has already been transmitted by the reception start (but not yet deducted from count)
             comparison must be done against 2*data_to_process */
          if (rx_data_count >= ((uint32_t)(husart->nb_rx_data_to_process) << 1))
          {
            /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
            LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
          }
        }
        else
        {
          /* Nothing to do */
        }
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rx_data_count = husart->rx_xfer_count;
    if (((rx_data_count != 0U)) && (rx_data_count < husart->nb_rx_data_to_process))
    {
      /* Disable the USART RXFT interrupt*/
      LL_USART_DisableIT_RXFT(p_usartx);

      /* Update the RxISR function pointer */
      husart->p_rx_isr = USART_RxISR_8BIT;

      /* Enable the USART Data Register Not Empty interrupt */
      LL_USART_EnableIT_RXNE_RXFNE(p_usartx);

      if ((husart->tx_xfer_count == 0U) && (husart->usart_mode == HAL_USART_MODE_MASTER))
      {
        /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
        LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
      }
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    LL_USART_RequestRxDataFlush(p_usartx);
  }
}

/**
  * @brief  Interrupt service routine for receiving 16bit data using FIFO.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note   Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Receive_IT() or HAL_USART_TransmitReceive_IT().
  * @note ISR function executed when FIFO mode is enabled and when the
  *          data word length is 9 bits long.
  */
static void USART_RxISR_16BIT_FIFOEN(hal_usart_handle_t *husart)
{
  hal_usart_state_t state = husart->global_state;
  uint32_t tx_data_count;
  uint32_t rx_data_count;
  uint32_t tx_ftie;
  uint16_t *tmp;
  uint16_t uh_mask = husart->rdr_register_mask;
  uint16_t nb_rx_data;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);

  /* Check that a Tx process is ongoing */
  if ((state == HAL_USART_STATE_RX_ACTIVE) || (state == HAL_USART_STATE_TX_RX_ACTIVE))
  {
    rx_data_count = husart->rx_xfer_count;
    for (nb_rx_data = husart->nb_rx_data_to_process ; nb_rx_data > 0U ; nb_rx_data--)
    {
      if (LL_USART_IsActiveFlag_RXNE_RXFNE(p_usartx) != 0U)
      {
        tmp = (uint16_t *) husart->p_rx_buff;
        *tmp = (LL_USART_ReceiveData9(p_usartx) & uh_mask);
        husart->p_rx_buff += 2U;
        husart->rx_xfer_count--;

        if (husart->rx_xfer_count == 0U)
        {
          /* Disable the USART Parity Error Interrupt */
          LL_USART_DisableIT_PE(p_usartx);

          /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error)
             and RX FIFO Threshold interrupt */
          LL_USART_DisableIT_CR3(p_usartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE));

          /* Clear p_rx_isr function pointer */
          husart->p_rx_isr = NULL;

          tx_ftie = LL_USART_IsEnabledIT_TXFT(p_usartx);
          tx_data_count = husart->tx_xfer_count;

