MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
          if (state == HAL_USART_STATE_RX_ACTIVE)
          {
            /* Clear SPI slave underrun flag and discard transmit data */
            if (husart->usart_mode == HAL_USART_MODE_SLAVE)
            {
              LL_USART_ClearFlag_UDR(p_usartx);
              LL_USART_RequestTxDataFlush(p_usartx);
            }
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
            /* if Rx FIFO full Optional IT has been activated, check if we can call the callback */
            if (LL_USART_IsEnabledIT_RXFF(p_usartx) != 0U)
            {
              if (LL_USART_IsActiveFlag_RXFF(p_usartx) != 0U)
              {
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
                /* Call registered Rx FIFO Full Callback */
                husart->p_rx_fifo_full_callback(husart);
#else
                /* Call legacy weak Rx FIFO Full Callback */
                HAL_USART_RxFifoFullCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
              }
            }
#endif /* USE_HAL_USART_FIFO */
            /* Rx process is completed, restore husart->global_state to Idle */
            husart->global_state = HAL_USART_STATE_IDLE;
            state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Rx Complete Callback */
            husart->p_rx_cplt_callback(husart);
#else
            /* Call legacy weak Rx Complete Callback */
            HAL_USART_RxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
          }
          else if ((LL_USART_IsEnabledIT_TC(p_usartx) == 0U) && (tx_ftie == 0U) && (tx_data_count == 0U))
          {
            /* TxRx process is completed, restore husart->global_state to Idle */
            husart->global_state = HAL_USART_STATE_IDLE;
            state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
            /* Call registered Tx Rx Complete Callback */
            husart->p_tx_rx_cplt_callback(husart);
#else
            /* Call legacy weak Tx Rx Complete Callback */
            HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
          }
          else
          {
            /* Nothing to do */
          }
        }
        else if ((state == HAL_USART_STATE_RX_ACTIVE) && (husart->usart_mode == HAL_USART_MODE_MASTER))
        {
          /* As data to process has already been transmitted by the reception start (but not yet deducted from count)
             comparison must be done against 2*data_to_process */
          if (rx_data_count >= ((uint32_t)(husart->nb_rx_data_to_process) << 1))
          {
            /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
            LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
          }
        }
        else
        {
          /* Nothing to do */
        }
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rx_data_count = husart->rx_xfer_count;
    if (((rx_data_count != 0U)) && (rx_data_count < husart->nb_rx_data_to_process))
    {
      /* Disable the USART RXFT interrupt*/
      LL_USART_DisableIT_RXFT(p_usartx);

      /* Update the RxISR function pointer */
      husart->p_rx_isr = USART_RxISR_16BIT;

      /* Enable the USART Data Register Not Empty interrupt */
      LL_USART_EnableIT_RXNE_RXFNE(p_usartx);

      if ((husart->tx_xfer_count == 0U) && (husart->usart_mode == HAL_USART_MODE_MASTER))
      {
        /* Send dummy byte in order to generate the clock for the Slave to Send the next data */
        LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
      }
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    LL_USART_RequestRxDataFlush(p_usartx);
  }
}

/**
  * @brief Calculate the number of data to process in RX/TX ISR.
  * @param husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @note The RX FIFO depth and the TX FIFO depth are extracted from the USART configuration registers.
  */
static void USART_SetNbDataToProcess(hal_usart_handle_t *husart)
{
  uint8_t rx_fifo_depth;
  uint8_t tx_fifo_depth;
  uint8_t rx_fifo_threshold;
  uint8_t tx_fifo_threshold;
  static const uint8_t numerator[]   = {1U, 1U, 1U, 3U, 7U, 1U, 0U, 0U};
  static const uint8_t denominator[] = {8U, 4U, 2U, 4U, 8U, 1U, 1U, 1U};
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  if (husart->fifo_mode == HAL_USART_FIFO_MODE_DISABLED)
  {
    husart->nb_tx_data_to_process = 1U;
    husart->nb_rx_data_to_process = 1U;
  }
  else
  {
    rx_fifo_depth = RX_FIFO_DEPTH;
    tx_fifo_depth = TX_FIFO_DEPTH;
    rx_fifo_threshold = (uint8_t)LL_USART_GetRXFIFOThreshold(p_usartx);
    tx_fifo_threshold = (uint8_t)LL_USART_GetTXFIFOThreshold(p_usartx);
    husart->nb_tx_data_to_process = ((uint16_t)tx_fifo_depth * numerator[tx_fifo_threshold]) /
                                    (uint16_t)denominator[tx_fifo_threshold];
    husart->nb_rx_data_to_process = ((uint16_t)rx_fifo_depth * numerator[rx_fifo_threshold]) /
                                    (uint16_t)denominator[rx_fifo_threshold];
  }
}

#endif /* USE_HAL_USART_FIFO */

/**
  * @brief  Wrap up transmission in non-blocking mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  */
static void USART_EndTransmit_IT(hal_usart_handle_t *husart)
{
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);

  /* Disable the USART Transmit Complete Interrupt */
  LL_USART_DisableIT_TC(p_usartx);

  /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
  LL_USART_DisableIT_ERROR(p_usartx);

  /* Clear p_tx_isr function pointer */
  husart->p_tx_isr = NULL;

  if (husart->global_state == HAL_USART_STATE_TX_ACTIVE)
  {
    /* Clear overrun flag and discard the received data */
    LL_USART_ClearFlag_ORE(p_usartx);
    LL_USART_RequestRxDataFlush(p_usartx);

    /* Tx process is completed */
    husart->global_state = HAL_USART_STATE_IDLE;

