MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call p_tx_cplt_callback Tx Complete Callback */
    husart->p_tx_cplt_callback(husart);
#else
    /* Call legacy weak Tx Complete Callback */
    HAL_USART_TxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
  }
  else if (husart->rx_xfer_count == 0U)
  {
    /* TxRx process is completed */
    husart->global_state = HAL_USART_STATE_IDLE;

#if defined(USE_HAL_USART_REGISTER_CALLBACKS) && (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    /* Call registered Tx Rx Complete Callback */
    husart->p_tx_rx_cplt_callback(husart);
#else
    /* Call legacy weak Tx Rx Complete Callback */
    HAL_USART_TxRxCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief  Start Transmit operation in interrupt mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing transmission in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Transmit started in IT mode.
  */
hal_status_t USART_Start_Transmit_IT(hal_usart_handle_t *husart, const uint8_t *p_data, uint32_t size,
                                     uint32_t interrupts)
{
  uint32_t reg_temp;
  uint32_t nine_bits_data;
  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);
#if !defined(USE_HAL_USART_FIFO) || (USE_HAL_USART_FIFO == 0)
  STM32_UNUSED(interrupts);
#endif /* USE_HAL_USART_FIFO */
  nine_bits_data = 0U;

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    nine_bits_data = 1U;
  }

  husart->p_tx_buff     = p_data;
  husart->tx_xfer_size  = size;
  husart->tx_xfer_count = size;
  husart->p_tx_isr        = NULL;

  /* The USART Error Interrupts: (Frame error, noise error, overrun error)
  are not managed by the USART Transmit Process to avoid the overrun interrupt.
  Note that when the usart mode is configured for transmit and receive ( State equal to "HAL_USART_STATE_TX_RX_ACTIVE")
  it is recommended to configure the usart mode to "HAL_USART_STATE_TX_ACTIVE",
  to benefit for the frame error and noise interrupts  */

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if (husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED)
  {
    if (nine_bits_data != 0U)
    {
      husart->p_tx_isr = USART_TxISR_16BIT_FIFOEN;
    }
    else
    {
      husart->p_tx_isr = USART_TxISR_8BIT_FIFOEN;
    }
    LL_USART_EnableIT_TXFT(p_usartx);
  }
  else
#endif /* USE_HAL_USART_FIFO */
  {
    if (nine_bits_data != 0U)
    {
      husart->p_tx_isr = USART_TxISR_16BIT;
    }
    else
    {
      husart->p_tx_isr = USART_TxISR_8BIT;
    }
    LL_USART_EnableIT_TXE_TXFNF(p_usartx);
  }
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if ((interrupts & HAL_USART_OPT_TX_IT_FIFO_EMPTY) == HAL_USART_OPT_TX_IT_FIFO_EMPTY)
  {
    LL_USART_EnableIT_TXFE(p_usartx);
  }
#endif /* USE_HAL_USART_FIFO */
  return HAL_OK;
}

/**
  * @brief  Start Receive operation in interrupt mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing reception in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Receive started in IT mode.
  */
hal_status_t USART_Start_Receive_IT(hal_usart_handle_t *husart, uint8_t *p_data, uint32_t size, uint32_t interrupts)
{
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  uint16_t nb_dummy_data;
#endif /* USE_HAL_USART_FIFO */
  uint32_t reg_temp;
  uint32_t nine_bits_data;
#if !defined(USE_HAL_USART_FIFO) || (USE_HAL_USART_FIFO == 0)
  STM32_UNUSED(interrupts);
#endif /* USE_HAL_USART_FIFO */

  USART_TypeDef *p_usartx = USART_GET_INSTANCE(husart);


  nine_bits_data = 0U;
  husart->p_rx_buff     = p_data;
  husart->rx_xfer_size  = size;
  husart->rx_xfer_count = size;
  husart->p_rx_isr        = NULL;

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    nine_bits_data = 1U;
  }

  if (USART_RDRMaskComputation(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  LL_USART_EnableIT_ERROR(p_usartx);

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if ((husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED) && (size >= husart->nb_rx_data_to_process))
  {
    if (nine_bits_data != 0U)
    {
      husart->p_rx_isr = USART_RxISR_16BIT_FIFOEN;
    }
    else
    {
      husart->p_rx_isr = USART_RxISR_8BIT_FIFOEN;
    }

    if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
    {
      LL_USART_EnableIT_PE(p_usartx);
    }
    LL_USART_EnableIT_RXFT(p_usartx);
  }
  else
#endif /* USE_HAL_USART_FIFO */
  {
    if (nine_bits_data != 0U)
    {
      husart->p_rx_isr = USART_RxISR_16BIT;
    }
    else
    {
      husart->p_rx_isr = USART_RxISR_8BIT;
    }

    if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
    {
      LL_USART_EnableIT_PE(p_usartx);
    }
    LL_USART_EnableIT_RXNE_RXFNE(p_usartx);
  }
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if ((interrupts & HAL_USART_OPT_RX_IT_FIFO_FULL) == HAL_USART_OPT_RX_IT_FIFO_FULL)
  {
    LL_USART_EnableIT_RXFF(p_usartx);
  }
#endif /* USE_HAL_USART_FIFO */

  if (husart->usart_mode == HAL_USART_MODE_MASTER)
  {
    /* Send dummy data in order to generate the clock for the Slave to send the next data.
       When FIFO mode is disabled only one data must be transferred.
       When FIFO mode is enabled data must be transmitted until the RX FIFO reaches its threshold.
    */
#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
    if ((husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED) && (size >= husart->nb_rx_data_to_process))
    {
      for (nb_dummy_data = husart->nb_rx_data_to_process ; nb_dummy_data > 0U ; nb_dummy_data--)
      {
        LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
      }
    }
    else
#endif /* USE_HAL_USART_FIFO */
    {
      LL_USART_TransmitData8(p_usartx, USART_DUMMY_DATA);
    }
  }
  return HAL_OK;
}

/**
  * @brief  Start Receive operation in interrupt mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_tx_data Pointer to rx data buffer (u8 or u16 data elements).
  * @param  p_rx_data Pointer to rx data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing transmission/reception in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Receive started in IT mode.
  */
hal_status_t USART_Start_TransmitReceive_IT(hal_usart_handle_t *husart, const uint8_t *p_tx_data, uint8_t *p_rx_data,
                                            uint32_t size, uint32_t interrupts)
{
  USART_TypeDef *p_usartx;
  uint32_t reg_temp;
  uint32_t nine_bits_data;
#if !defined(USE_HAL_USART_FIFO) || (USE_HAL_USART_FIFO == 0)
  STM32_UNUSED(interrupts);
#endif /* USE_HAL_USART_FIFO */

  p_usartx = USART_GET_INSTANCE(husart);

