MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
  nine_bits_data = 0U;
  husart->p_rx_buff     = p_rx_data;
  husart->rx_xfer_size  = size;
  husart->rx_xfer_count = size;
  husart->p_tx_buff     = p_tx_data;
  husart->tx_xfer_size  = size;
  husart->tx_xfer_count = size;

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    nine_bits_data = 1U;
  }

  if (USART_RDRMaskComputation(husart) != HAL_OK)
  {
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  LL_USART_EnableIT_ERROR(p_usartx);
  if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
  {
    LL_USART_EnableIT_PE(p_usartx);
  }

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  /* Configure TxRx interrupt processing */
  if ((husart->fifo_mode == HAL_USART_FIFO_MODE_ENABLED) && (size >= husart->nb_rx_data_to_process))
  {
    /* Set the Rx ISR function pointer according to the data word length */
    if (nine_bits_data != 0U)
    {
      husart->p_tx_isr = USART_TxISR_16BIT_FIFOEN;
      husart->p_rx_isr = USART_RxISR_16BIT_FIFOEN;
    }
    else
    {
      husart->p_tx_isr = USART_TxISR_8BIT_FIFOEN;
      husart->p_rx_isr = USART_RxISR_8BIT_FIFOEN;
    }
    LL_USART_EnableIT_RXFT(p_usartx);
    LL_USART_EnableIT_TXFT(p_usartx);
  }
  else
#endif /* USE_HAL_USART_FIFO */
  {
    if (nine_bits_data != 0U)
    {
      husart->p_tx_isr = USART_TxISR_16BIT;
      husart->p_rx_isr = USART_RxISR_16BIT;
    }
    else
    {
      husart->p_tx_isr = USART_TxISR_8BIT;
      husart->p_rx_isr = USART_RxISR_8BIT;
    }
    LL_USART_EnableIT_RXNE_RXFNE(p_usartx);
    LL_USART_EnableIT_TXE_TXFNF(p_usartx);
  }

#if defined(USE_HAL_USART_FIFO) && (USE_HAL_USART_FIFO == 1)
  if ((interrupts & HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY) == HAL_USART_OPT_TXRX_TX_IT_FIFO_EMPTY)
  {
    LL_USART_EnableIT_TXFE(p_usartx);
  }
  if ((interrupts & HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL) == HAL_USART_OPT_TXRX_RX_IT_FIFO_FULL)
  {
    LL_USART_EnableIT_RXFF(p_usartx);
  }
#endif /* USE_HAL_USART_FIFO */
  return HAL_OK;
}

#if defined(USE_HAL_USART_DMA) && (USE_HAL_USART_DMA == 1)

/**
  * @brief  Start Transmit operation in DMA mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing transmission in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t USART_Start_Transmit_DMA(hal_usart_handle_t *husart, const uint8_t *p_data, uint32_t size,
                                      uint32_t interrupts)
{
  USART_TypeDef *p_usartx;
  uint32_t interrupts_dma;

  p_usartx = USART_GET_INSTANCE(husart);
  husart->p_tx_buff     = p_data;
  husart->tx_xfer_size  = size;
  husart->tx_xfer_count = size;
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (interrupts == HAL_USART_OPT_DMA_TX_IT_SILENT)
  {
    interrupts_dma = HAL_USART_OPT_DMA_TX_IT_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    interrupts_dma = (interrupts & HAL_USART_OPT_DMA_TX_IT_HT);
  }

  /* Set the USART DMA transfer complete callback */
  husart->hdma_tx->p_xfer_cplt_cb = USART_DMATransmitCplt;

  /* Set the USART DMA Half transfer complete callback */
  husart->hdma_tx->p_xfer_halfcplt_cb = USART_DMATxHalfCplt;

  /* Set the DMA error callback */
  husart->hdma_tx->p_xfer_error_cb = USART_DMAError;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(husart->hdma_tx, (uint32_t)husart->p_tx_buff, (uint32_t)&p_usartx->TDR,
                                     size, interrupts_dma) != HAL_OK)
  {
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
    husart->last_error_codes |= HAL_USART_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  LL_USART_ClearFlag_TC(p_usartx);
  LL_USART_EnableDMAReq_TX(p_usartx);

  return HAL_OK;
}

/**
  * @brief  Start Receive operation in DMA mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing reception in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t USART_Start_Receive_DMA(hal_usart_handle_t *husart, uint8_t *p_data, uint32_t size, uint32_t interrupts)
{
  uint32_t reg_temp;
  uint32_t interrupts_dma;
  USART_TypeDef *p_usartx;

  p_usartx = USART_GET_INSTANCE(husart);
  husart->p_rx_buff     = p_data;
  husart->rx_xfer_size  = size;
  husart->p_tx_buff     = p_data;
  husart->tx_xfer_size  = size;
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (interrupts == HAL_USART_OPT_DMA_RX_IT_SILENT)
  {
    interrupts_dma = HAL_USART_OPT_DMA_RX_IT_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    interrupts_dma = (interrupts & HAL_USART_OPT_DMA_RX_IT_HT);
  }
  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  /* Set the USART DMA Rx transfer complete callback */
  husart->hdma_rx->p_xfer_cplt_cb = USART_DMAReceiveCplt;

  /* Set the USART DMA Half transfer complete callback */
  husart->hdma_rx->p_xfer_halfcplt_cb = USART_DMARxHalfCplt;

  /* Set the USART DMA Rx transfer error callback */
  husart->hdma_rx->p_xfer_error_cb = USART_DMAError;

  if (HAL_DMA_StartPeriphXfer_IT_Opt(husart->hdma_rx, (uint32_t)&p_usartx->RDR, (uint32_t)husart->p_rx_buff,
                                     size, interrupts_dma) != HAL_OK)
  {
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
    husart->last_error_codes |= HAL_USART_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
    (void)HAL_DMA_Abort(husart->hdma_rx);
    husart->global_state = HAL_USART_STATE_IDLE;
    return HAL_ERROR;
  }

  if (husart->usart_mode == HAL_USART_MODE_MASTER)
  {
    /* Enable the USART transmit DMA channel: the transmit channel is used in order
        to generate in the non-blocking mode the clock to the slave device */

    /* Set the USART DMA Error callback to Null */
    /* Need to set Tx Complete callback because the DMA does not check the callback before calling it */
    if (husart->hdma_tx != NULL)
    {
      husart->hdma_tx->p_xfer_error_cb = USART_DMADummy;
      husart->hdma_tx->p_xfer_cplt_cb = USART_DMADummy;

