MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_usart.c
      if (HAL_DMA_StartPeriphXfer_IT_Opt(husart->hdma_tx, (uint32_t)husart->p_tx_buff, (uint32_t)&p_usartx->TDR,
                                         size, HAL_DMA_OPT_IT_NONE) != HAL_OK)
      {
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
        husart->last_error_codes |= HAL_USART_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
        (void)HAL_DMA_Abort(husart->hdma_rx);
        husart->global_state = HAL_USART_STATE_IDLE;
        return HAL_ERROR;
      }
    }
    else
    {
      (void)HAL_DMA_Abort(husart->hdma_rx);
      husart->global_state = HAL_USART_STATE_IDLE;
      return HAL_ERROR;
    }
  }
  LL_USART_EnableIT_ERROR(p_usartx);
  if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
  {
    LL_USART_EnableIT_PE(p_usartx);
  }
  LL_USART_EnableDMAReq_TX(p_usartx);
  LL_USART_EnableDMAReq_RX(p_usartx);

  return HAL_OK;
}


/**
  * @brief  Start Transmit Receive operation in DMA mode.
  * @param  husart Pointer to a \ref hal_usart_handle_t structure which contains the USART instance.
  * @param  p_rx_data Pointer to data buffer (u8 or u16 data elements).
  * @param  p_tx_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL USART API providing reception in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t USART_Start_TransmitReceive_DMA(hal_usart_handle_t *husart, const uint8_t *p_tx_data, uint8_t *p_rx_data,
                                             uint32_t size, uint32_t interrupts)
{
  USART_TypeDef *p_usartx;
  uint32_t reg_temp;
  uint32_t interrupts_dma_rx;
  uint32_t interrupts_dma_tx;

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (interrupts == HAL_USART_OPT_DMA_TXRX_IT_SILENT)
  {
    interrupts_dma_rx = HAL_USART_OPT_DMA_TXRX_IT_SILENT;
    interrupts_dma_tx = HAL_USART_OPT_DMA_TXRX_IT_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    interrupts_dma_rx = (interrupts & HAL_USART_OPT_DMA_TXRX_RX_IT_HT);
    interrupts_dma_tx = (interrupts & HAL_USART_OPT_DMA_TXRX_TX_IT_HT);
  }

  p_usartx = USART_GET_INSTANCE(husart);
  husart->p_rx_buff     = p_rx_data;
  husart->rx_xfer_size  = size;
  husart->p_tx_buff     = p_tx_data;
  husart->tx_xfer_size  = size;

  reg_temp = LL_USART_READ_REG(p_usartx, CR1);

  if ((husart->hdma_rx != NULL) && (husart->hdma_tx != NULL))
  {
    /* Set the USART DMA Rx transfer complete callback */
    husart->hdma_rx->p_xfer_cplt_cb = USART_DMAReceiveCplt;

    /* Set the USART DMA Half transfer complete callback */
    husart->hdma_rx->p_xfer_halfcplt_cb = USART_DMARxHalfCplt;

    /* Set the USART DMA Tx transfer complete callback */
    husart->hdma_tx->p_xfer_cplt_cb = USART_DMATransmitCplt;

    /* Set the USART DMA Half transfer complete callback */
    husart->hdma_tx->p_xfer_halfcplt_cb = USART_DMATxHalfCplt;

    /* Set the USART DMA Tx transfer error callback */
    husart->hdma_tx->p_xfer_error_cb = USART_DMAError;

    /* Set the USART DMA Rx transfer error callback */
    husart->hdma_rx->p_xfer_error_cb = USART_DMAError;

    if (HAL_DMA_StartPeriphXfer_IT_Opt(husart->hdma_rx, (uint32_t)&p_usartx->RDR, (uint32_t)husart->p_rx_buff,
                                       size, interrupts_dma_rx) != HAL_OK)
    {
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
      husart->last_error_codes |= HAL_USART_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
      if (husart->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
      {
        (void)HAL_DMA_Abort(husart->hdma_rx);
      }
#endif /* USE_HAL_DMA_LINKEDLIST */
      husart->global_state = HAL_USART_STATE_IDLE;
      return HAL_ERROR;
    }

    if (HAL_DMA_StartPeriphXfer_IT_Opt(husart->hdma_tx, (uint32_t)husart->p_tx_buff, (uint32_t)&p_usartx->TDR,
                                       size, interrupts_dma_tx) != HAL_OK)
    {
      husart->global_state = HAL_USART_STATE_IDLE;
#if defined (USE_HAL_USART_GET_LAST_ERRORS) && (USE_HAL_USART_GET_LAST_ERRORS == 1)
      husart->last_error_codes |= HAL_USART_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_USART_GET_LAST_ERRORS */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
      if (husart->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
      {
        (void)HAL_DMA_Abort(husart->hdma_tx);
      }
#endif /* USE_HAL_DMA_LINKEDLIST */
      return HAL_ERROR;
    }
  }
  LL_USART_EnableIT_ERROR(p_usartx);
  if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
  {
    LL_USART_EnableIT_PE(p_usartx);
  }
  LL_USART_ClearFlag_TC(p_usartx);

  LL_USART_EnableDMAReq_TX(p_usartx);
  LL_USART_EnableDMAReq_RX(p_usartx);

  return HAL_OK;
}

#endif /* USE_HAL_USART_DMA */
/**
  * @}
  */

/**
  * @}
  */
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 */
#endif /* USE_HAL_USART_MODULE */

/**
  * @}
  */
